{
    "ironia": {
      "descricao": "A ironia ocorre quando há uma contradição entre o que é dito e o que realmente se quer dizer. Normalmente, é usada para expressar sarcasmo, crítica ou humor, e seu entendimento depende do contexto e da entonação. A ironia pode estar presente em diversas formas de discurso, como literatura, conversas cotidianas e até mesmo notícias. Muitas vezes, ela depende da interpretação subjetiva do receptor, tornando-se uma figura de linguagem que pode gerar diferentes reações, como humor ou indignação. Por isso, a ironia é uma ferramenta poderosa na comunicação, podendo ser usada para suavizar críticas ou enfatizar absurdos.",
      "perguntas": [
        {
          "pergunta": "Que alegria! Meu computador travou e perdi todo o trabalho que não salvei!",
          "opcoes": ["Ironia", "Hipérbole", "Eufemismo", "Metáfora"],
          "correta": 0,
          "explicacao": "A ironia está presente no contraste entre a expressão de alegria e a situação claramente negativa. A hipérbole exageraria o problema, o eufemismo suavizaria e a metáfora faria uma comparação implícita."
        },
        {
          "pergunta": "Adoro quando o despertador toca às 5 da manhã em pleno domingo!",
          "opcoes": ["Ironia", "Hipérbole", "Personificação", "Antítese"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' algo que normalmente é desagradável. A hipérbole exageraria a situação, a personificação daria características humanas ao despertador e a antítese apresentaria ideias opostas."
        },
        {
          "pergunta": "Que maravilha! Acabei de limpar o chão e o cachorro entrou com as patas sujas!",
          "opcoes": ["Ironia", "Metáfora", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre a expressão positiva e a situação frustrante. A metáfora compararia a situação a algo simbólico, a hipérbole exageraria e o eufemismo suavizaria."
        },
        {
          "pergunta": "Estou tão feliz que meu celular quebrou um dia depois de acabar a garantia!",
          "opcoes": ["Ironia", "Hipérbole", "Metonímia", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está presente no contraste entre a falsa felicidade e a situação claramente negativa. A hipérbole exageraria o problema, a metonímia substituiria um termo por outro e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que sorte a minha! Consegui pegar o último lugar na fila do banco!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre considerar 'sorte' uma situação desfavorável. A hipérbole exageraria a situação, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Fantástico! Agora começou a chover e eu esqueci o guarda-chuva!",
          "opcoes": ["Ironia", "Hipérbole", "Personificação", "Metonímia"],
          "correta": 0,
          "explicacao": "A ironia está no uso de um termo positivo para descrever uma situação negativa. A hipérbole exageraria o problema, a personificação daria características humanas à chuva e a metonímia substituiria um termo por outro."
        },
        {
          "pergunta": "Adoro quando as pessoas me interrompem enquanto estou falando!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' algo que normalmente é considerado desrespeitoso. A hipérbole exageraria a situação, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que dia perfeito para um piquenique! Está caindo o maior temporal!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre considerar um dia chuvoso como 'perfeito' para uma atividade ao ar livre. A hipérbole exageraria a situação, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
          "pergunta": "Que ótimo! Minha dieta está indo super bem depois de comer esse bolo inteiro!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre considerar positivo algo que vai contra o objetivo da dieta. A hipérbole exageraria a situação, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Estou muito feliz em ficar preso no trânsito por duas horas!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Prosopopeia"],
          "correta": 0,
          "explicacao": "A ironia está na expressão de felicidade por uma situação claramente frustrante. A hipérbole exageraria o tempo no trânsito, a metáfora compararia a situação a algo simbólico e a prosopopeia daria características humanas a seres inanimados."
        },
        {
          "pergunta": "Que maravilha receber a conta de luz triplicada este mês!",
          "opcoes": ["Ironia", "Hipérbole", "Eufemismo", "Metonímia"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre considerar 'maravilhoso' um aumento na conta de luz. A hipérbole exageraria o valor, o eufemismo suavizaria o problema e a metonímia substituiria um termo por outro relacionado."
        },
        {
          "pergunta": "Adoro quando o garçom derrama bebida no meu celular novo!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' um acidente que pode danificar um objeto valioso. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
          "pergunta": "Que sorte! Consegui pegar todos os semáforos vermelhos hoje!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está em chamar de 'sorte' uma situação que normalmente é considerada azar. A hipérbole exageraria a quantidade de semáforos, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que delícia este remédio amargo que tenho que tomar todos os dias!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre chamar de 'delícia' algo de sabor desagradável. A hipérbole exageraria o sabor, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Estou tão animado para trabalhar até tarde em pleno feriado!",
          "opcoes": ["Ironia", "Hipérbole", "Eufemismo", "Prosopopeia"],
          "correta": 0,
          "explicacao": "A ironia está na expressão de animação por uma situação geralmente considerada negativa. A hipérbole exageraria a situação, o eufemismo suavizaria e a prosopopeia daria características humanas a seres inanimados."
        },
        {
          "pergunta": "Que experiência incrível esperar três horas na fila do banco!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Metonímia"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre chamar de 'incrível' uma experiência tediosa. A hipérbole exageraria o tempo de espera, a metáfora faria uma comparação implícita e a metonímia substituiria um termo por outro relacionado."
        },
        {
          "pergunta": "Adoro quando meu vizinho toca bateria às 3 da manhã!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' uma situação que normalmente causaria incômodo. A hipérbole exageraria o barulho, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que ótimo! Meu time perdeu pela quinta vez seguida!",
          "opcoes": ["Ironia", "Hipérbole", "Eufemismo", "Metonímia"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre a expressão positiva e a situação negativa. A hipérbole exageraria o número de derrotas, o eufemismo suavizaria e a metonímia substituiria um termo por outro relacionado."
        },
        {
          "pergunta": "Estou adorando esse congestionamento de cinco horas na estrada!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' uma situação frustrante. A hipérbole exageraria o tempo no congestionamento, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
          "pergunta": "Que maravilha! Meu voo foi cancelado e agora tenho que dormir no aeroporto!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre a expressão positiva e a situação claramente negativa. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Adoro quando o professor marca prova surpresa na segunda-feira!",
          "opcoes": ["Ironia", "Hipérbole", "Prosopopeia", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' uma situação que normalmente causa estresse. A hipérbole exageraria a dificuldade, a prosopopeia daria características humanas a seres inanimados e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que delícia este café com gosto de queimado!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre chamar de 'delícia' algo com sabor desagradável. A hipérbole exageraria o sabor ruim, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Estou tão animado para fazer essa fila de 3 horas no parque de diversões!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre estar 'animado' para uma situação entediante. A hipérbole exageraria o tempo de espera, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
          "pergunta": "Que ótimo! Meu notebook quebrou bem no dia da entrega do trabalho!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre a expressão positiva e a situação claramente negativa. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
          "pergunta": "Adoro quando a impressora resolve parar de funcionar na hora mais importante!",
          "opcoes": ["Ironia", "Hipérbole", "Personificação", "Eufemismo"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre 'adorar' uma situação frustrante. A hipérbole exageraria o problema, a personificação atribuiria intenção à impressora e o eufemismo suavizaria."
        },
        {
          "pergunta": "Que sorte a minha! Quebrei o braço justamente antes das férias na praia!",
          "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Metonímia"],
          "correta": 0,
          "explicacao": "A ironia está na contradição entre considerar 'sorte' uma situação claramente negativa. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e a metonímia substituiria um termo por outro relacionado."
        },
        {
        "pergunta": "Estou muito feliz por ter acordado com dor de garganta no dia da apresentação!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão de felicidade e a situação negativa de estar doente em um momento importante. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que maravilha! A festa acabou bem na hora que eu cheguei!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'maravilhoso' um evento frustrante. A hipérbole exageraria a situação, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Adoro quando esquecem de me avisar sobre a reunião importante!",
        "opcoes": ["Ironia", "Hipérbole", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' uma situação que gera problemas profissionais. A hipérbole exageraria as consequências, a metonímia substituiria um termo por outro relacionado e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que sorte! Acabou a bateria do meu celular quando eu ia fazer uma ligação urgente!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'sorte' uma situação que impede algo necessário. A hipérbole exageraria a urgência, a metáfora faria uma comparação implícita e o pleonasmo seria uma redundância."
        },
        {
        "pergunta": "Estou encantado com essa música irritante que não sai da minha cabeça!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre estar 'encantado' com algo descrito como irritante. A hipérbole exageraria o incômodo, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
        "pergunta": "Que ótimo! Fiquei uma hora no telefone só para ouvir que não podem resolver meu problema!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão positiva e a frustração da situação. A hipérbole exageraria o tempo de espera, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Adoro quando meu colega de apartamento deixa a louça suja por dias!",
        "opcoes": ["Ironia", "Hipérbole", "Metonímia", "Antítese"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' um comportamento considerado desagradável. A hipérbole exageraria a quantidade de louça, a metonímia substituiria um termo por outro relacionado e a antítese apresentaria ideias opostas."
        },
        {
        "pergunta": "Que delícia esse remédio com gosto de plástico queimado!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre chamar de 'delícia' algo com sabor ruim. A hipérbole exageraria o sabor desagradável, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Estou muito animado para ficar preso em casa com febre no fim de semana!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre estar 'animado' com uma situação limitante. A hipérbole exageraria o desconforto, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que maravilha! O ar-condicionado quebrou no dia mais quente do ano!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'maravilhoso' um evento que causa desconforto. A hipérbole exageraria o calor, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Adoro quando o dentista diz que preciso fazer mais um canal!",
        "opcoes": ["Ironia", "Hipérbole", "Personificação", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' uma notícia normalmente considerada ruim. A hipérbole exageraria o medo do procedimento, a personificação daria características humanas a seres inanimados e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que sorte a minha! Consegui perder as chaves do carro em plena chuva!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'sorte' uma situação problemática. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Estou muito feliz por trocar meu final de semana na praia por horas fazendo relatório!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão de felicidade e a troca claramente desfavorável. A hipérbole exageraria o tempo de trabalho, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que ótimo! O restaurante fechou bem na hora que eu cheguei morrendo de fome!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Metonímia"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão positiva e a situação frustrante. A hipérbole seria a expressão 'morrendo de fome', a metáfora faria uma comparação implícita e a metonímia substituiria um termo por outro relacionado."
        },
        {
        "pergunta": "Adoro quando o carro quebra na estrada deserta!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' uma situação potencialmente perigosa. A hipérbole exageraria o isolamento, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que delícia esta comida sem sal e sem tempero!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre chamar de 'delícia' uma comida sem sabor. A hipérbole exageraria a falta de tempero, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Estou tão animado para passar o feriado inteiro estudando para a prova!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre estar 'animado' para uma atividade que substitui o descanso. A hipérbole exageraria o tempo de estudo, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que maravilha! O filme começou exatamente quando cheguei atrasado ao cinema!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Prosopopeia"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'maravilhoso' perder o início do filme. A hipérbole exageraria o atraso, a metáfora faria uma comparação implícita e a prosopopeia daria características humanas a seres inanimados."
        },
        {
        "pergunta": "Adoro quando o professor marca três provas para o mesmo dia!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' uma situação estressante. A hipérbole exageraria a dificuldade, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que sorte! Meu computador formatou justamente quando eu ia salvar o trabalho!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Antítese"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'sorte' perder um trabalho importante. A hipérbole exageraria a perda, a metáfora faria uma comparação implícita e a antítese apresentaria ideias opostas."
        },
        {
        "pergunta": "Estou tão feliz que meu voo atrasou 5 horas!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão de felicidade e o inconveniente do atraso. A hipérbole exageraria o tempo de espera, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que ótimo! Esqueci meu guarda-chuva justamente no dia do temporal!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre a expressão positiva e a situação desagradável. A hipérbole exageraria a intensidade da chuva, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Adoro quando o ônibus passa direto pela parada quando estou atrasado!",
        "opcoes": ["Ironia", "Hipérbole", "Personificação", "Metonímia"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre 'adorar' uma situação que piora o atraso. A hipérbole exageraria o problema, a personificação daria intenção ao ônibus e a metonímia substituiria um termo por outro relacionado."
        },
        {
        "pergunta": "Que delícia esse suco com gosto de remédio!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Sinestesia"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre chamar de 'delícia' algo com sabor ruim. A hipérbole exageraria o sabor desagradável, a metáfora faria uma comparação implícita e a sinestesia misturaria sensações diferentes."
        },
        {
        "pergunta": "Estou super animado para enfrentar esse engarrafamento de duas horas!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre estar 'animado' para uma situação tediosa. A hipérbole exageraria o tempo no trânsito, a metáfora faria uma comparação implícita e o eufemismo suavizaria."
        },
        {
        "pergunta": "Que maravilha! O site caiu no momento exato em que eu ia finalizar a compra!",
        "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Personificação"],
        "correta": 0,
        "explicacao": "A ironia está na contradição entre considerar 'maravilhoso' um evento frustrante. A hipérbole exageraria o problema, a metáfora faria uma comparação implícita e a personificação daria características humanas ao site."
        },
        {
            "pergunta": "Que dia lindo! Está chovendo tanto que parece um dilúvio!",
            "opcoes": ["Ironia", "Hipérbole", "Sarcasmo", "Metáfora"],
            "correta": 0,
            "explicacao": "A ironia está na contradição entre 'dia lindo' e a chuva intensa. A hipérbole exageraria a chuva, o sarcasmo teria tom mais agressivo e a metáfora faria uma comparação implícita."
          },
          {
            "pergunta": "Adoro quando meu cachorro late a noite toda! Ótimo para o sono!",
            "opcoes": ["Ironia", "Sarcasmo", "Eufemismo", "Personificação"],
            "correta": 0,
            "explicacao": "A ironia está na contradição entre 'adorar' e o incômodo real. O sarcasmo seria mais mordaz, o eufemismo suavizaria e a personificação daria características humanas ao cachorro."
          },
          {
            "pergunta": "Excelente! O elevador quebrou e agora temos que subir 20 andares!",
            "opcoes": ["Ironia", "Hipérbole", "Sarcasmo", "Metonímia"],
            "correta": 0,
            "explicacao": "A ironia usa 'excelente' para destacar uma situação negativa. A hipérbole exageraria os andares, o sarcasmo seria mais ácido e a metonímia substituiria termos relacionados."
          },
          {
            "pergunta": "Que sorte! Perdi o ônibus e agora vou chegar duas horas atrasado!",
            "opcoes": ["Ironia", "Sarcasmo", "Eufemismo", "Antítese"],
            "correta": 0,
            "explicacao": "A ironia está em chamar de 'sorte' um evento claramente negativo. O sarcasmo teria tom mais hostil, o eufemismo suavizaria e a antítese oporia ideias."
          },
          {
            "pergunta": "Maravilhoso! O café da manhã queimado é exatamente como eu gosto!",
            "opcoes": ["Ironia", "Hipérbole", "Metáfora", "Paradoxo"],
            "correta": 0,
            "explicacao": "A ironia contrasta 'maravilhoso' com o café queimado. A hipérbole exageraria o sabor, a metáfora compararia conceitos e o paradoxo uniria contradições."
          },
          {
            "pergunta": "Que ótimo! O prazo do projeto foi encurtado pela metade!",
            "opcoes": ["Ironia", "Sarcasmo", "Zeugma", "Aliteração"],
            "correta": 0,
            "explicacao": "A ironia usa 'ótimo' para criticar a pressão do prazo. O sarcasmo seria mais cortante, o zeugma omitiria termos e a aliteração repetiria sons consonantais."
          },
          {
            "pergunta": "Adoro quando chove no dia do piquenique! Tudo fica mais emocionante!",
            "opcoes": ["Ironia", "Hipérbole", "Eufemismo", "Sinestesia"],
            "correta": 0,
            "explicacao": "A ironia está na contradição entre 'adorar' e a situação desagradável. A hipérbole exageraria a chuva, o eufemismo suavizaria e a sinestesia misturaria sensações."
          },
          {
            "pergunta": "Perfeito! O computador travou e perdi três horas de trabalho!",
            "opcoes": ["Ironia", "Sarcasmo", "Metáfora", "Pleonasmo"],
            "correta": 0,
            "explicacao": "A ironia usa 'perfeito' para enfatizar a frustração. O sarcasmo seria mais agressivo, a metáfora compararia conceitos e o pleonasmo seria redundante."
          },
          {
            "pergunta": "Que delícia! A comida está tão fria que parece gelada!",
            "opcoes": ["Ironia", "Hipérbole", "Sarcasmo", "Catacrese"],
            "correta": 0,
            "explicacao": "A ironia contrasta 'delícia' com a comida gelada. A hipérbole exageraria a temperatura, o sarcasmo seria mais ácido e a catacrese usaria metáforas cristalizadas."
          },
          {
            "pergunta": "Incrível! Consegui pegar todos os semáforos vermelhos no caminho!",
            "opcoes": ["Ironia", "Sarcasmo", "Polissíndeto", "Anáfora"],
            "correta": 0,
            "explicacao": "A ironia usa 'incrível' para destacar o azar. O sarcasmo teria tom mais hostil, o polissíndeto repetiria conjunções e a anáfora repetiria palavras iniciais."
          }
    ]
  }, 
    "sarcasmo": {
      "descricao": "O sarcasmo é uma forma de ironia mordaz, geralmente usada para zombar, ridicularizar ou expressar desprezo. Caracteriza-se pelo uso de linguagem cortante e frequentemente acompanhada de um tom de voz específico. Diferente da ironia simples, o sarcasmo tem uma intenção mais agressiva e direta, buscando expor contradições ou absurdos de forma mais contundente. O sarcasmo pode ser um mecanismo de defesa, uma forma de humor ou um instrumento de crítica social. Sua eficácia depende do contexto, da entonação e do relacionamento entre os interlocutores, podendo ser interpretado como engraçado ou ofensivo dependendo dessas variáveis.",
      "perguntas": [
        {
          "pergunta": "Uau, você é um gênio! Só demorou três horas para resolver um problema de matemática básica.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa admiração que na verdade é uma crítica mordaz à lentidão. A ironia seria mais sutil, a hipérbole apenas exageraria o tempo e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Não, imagina! Eu adoro quando você chega duas horas atrasado sem avisar.",
          "opcoes": ["Sarcasmo", "Ironia", "Antítese", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na afirmação contrária ao que se sente, com tom cortante. A ironia simples seria menos mordaz, a antítese apresentaria ideias opostas e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Muito obrigado por derramar café no meu laptop novo. Era exatamente o que eu precisava hoje.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Metáfora"],
          "correta": 0,
          "explicacao": "O sarcasmo está no agradecimento falso que na verdade expressa irritação. A ironia seria mais sutil, a hipérbole exageraria o dano e a metáfora faria uma comparação implícita."
        },
        {
          "pergunta": "Nossa, que ideia brilhante! Vamos cortar o orçamento da educação para construir mais prisões!",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está no elogio falso que na verdade é uma crítica contundente à política. A ironia seria menos agressiva, a hipérbole exageraria os efeitos e o eufemismo suavizaria o problema."
        },
        {
          "pergunta": "Ah, claro! Porque ninguém nunca pensou nisso antes. Você é um verdadeiro pioneiro!",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Personificação"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa admiração que na verdade ridiculariza uma ideia comum. A ironia seria mais sutil, a hipérbole apenas exageraria e a personificação daria características humanas a algo inanimado."
        },
        {
          "pergunta": "Sim, continue me explicando como fazer meu trabalho. Afinal, só tenho 15 anos de experiência nisso.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está no convite falso à explicação que na verdade critica a mansplaining. A ironia seria menos direta, a hipérbole exageraria a experiência e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Por favor, fale mais alto. Acho que tem alguém a dois quarteirões que ainda não ouviu.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Metonímia"],
          "correta": 0,
          "explicacao": "O sarcasmo está no pedido falso que na verdade critica o volume da fala. A ironia seria menos cortante, a hipérbole é usada a serviço do sarcasmo neste caso, e a metonímia substituiria um termo por outro relacionado."
        },
        {
          "pergunta": "Não, sua apresentação não foi entediante. Eu só estava praticando como dormir com os olhos abertos.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na negação falsa seguida de uma crítica mordaz. A ironia seria menos direta, a hipérbole exageraria o tédio e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Ah, você quebrou meu celular? Não tem problema, eu estava mesmo precisando de um peso de papel.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Metáfora"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa aceitação que na verdade é uma crítica ao dano. A ironia seria menos cortante, a hipérbole exageraria o dano e a metáfora compararia o celular quebrado a um peso de papel."
        },
        {
          "pergunta": "Claro, porque todo mundo sabe que a melhor forma de resolver problemas é ignorá-los completamente.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na concordância falsa que critica uma atitude escapista. A ironia seria mais sutil, a hipérbole exageraria o problema e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Não, não estou ocupado. Só estou trabalhando em um projeto urgente, mas posso largá-lo para resolver seu problema trivial.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na negação falsa que na verdade expressa irritação com a interrupção. A ironia seria menos mordaz, a hipérbole exageraria a urgência e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Ah, moro em um apartamento mínimo, mas gosto de chamá-lo de 'próximo de tudo'.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na descrição do apartamento que ridiculariza os anúncios imobiliários. A ironia seria mais sutil, a hipérbole exageraria o tamanho e o eufemismo é usado para criar o efeito sarcástico."
        },
        {
          "pergunta": "Seu corte de cabelo está ótimo! Parece que você brigou com um cortador de grama.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Metáfora"],
          "correta": 0,
          "explicacao": "O sarcasmo está no elogio falso seguido de uma zombaria direta. A ironia seria menos agressiva, a hipérbole exageraria o problema e a metáfora compararia o cabelo a algo mal cortado."
        },
        {
          "pergunta": "Sim, estou super animado para trabalhar no fim de semana. Não tinha nada melhor para fazer mesmo.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa animação que na verdade expressa descontentamento. A ironia seria menos cortante, a hipérbole exageraria a falta de opções e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Claro, porque os políticos são sempre tão honestos e preocupados com o bem-estar do povo.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na concordância falsa que na verdade critica a classe política. A ironia seria menos mordaz, a hipérbole exageraria a desonestidade e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Ah, você não entregou o trabalho no prazo? Não se preocupe, não é como se tivesse tido um mês inteiro para fazê-lo.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa compreensão que na verdade é uma crítica à procrastinação. A ironia seria mais sutil, a hipérbole exageraria o tempo disponível e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Não, não estou com fome. Só não como há dois dias, mas estou perfeitamente bem.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na negação falsa que na verdade expressa fome extrema. A ironia seria menos direta, a hipérbole exageraria o tempo sem comer e o eufemismo suavizaria o problema."
        },
        {
          "pergunta": "Ah sim, a reunião das 7h da manhã de segunda-feira foi uma ideia brilhante. Todos adoram acordar cedo depois do fim de semana.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está no falso elogio que na verdade critica o horário da reunião. A ironia seria menos mordaz, a hipérbole exageraria o incômodo e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Nossa, que surpresa! Você chegou atrasado de novo. Isso nunca aconteceu antes.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa surpresa que na verdade critica um comportamento recorrente. A ironia seria mais sutil, a hipérbole exageraria a frequência e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Claro, porque jogar lixo no chão é exatamente o que o planeta precisa agora.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Personificação"],
          "correta": 0,
          "explicacao": "O sarcasmo está na concordância falsa que na verdade critica uma atitude ambientalmente incorreta. A ironia seria menos direta, a hipérbole exageraria o impacto e a personificação daria características humanas ao planeta."
        },
        {
          "pergunta": "Ah, você está me dizendo como fazer meu trabalho? Por favor, continue. Sua experiência de zero anos neste campo é muito valiosa.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está no falso pedido de continuação que na verdade critica a falta de experiência. A ironia seria menos mordaz, a hipérbole exageraria a inexperiência e o eufemismo suavizaria a crítica."
        },
        {
          "pergunta": "Não, não estou bravo. Estou apenas respirando fundo e contando até dez porque adoro matemática.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na negação falsa que na verdade expressa irritação. A ironia seria mais sutil, a hipérbole exageraria a raiva e o eufemismo suavizaria o sentimento."
        },
        {
          "pergunta": "Ah sim, porque assistir a mais um episódio às 3 da manhã é uma decisão muito inteligente quando tenho que acordar às 6h.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa afirmação de que seria uma decisão inteligente. A ironia seria menos direta, a hipérbole exageraria as consequências e o eufemismo suavizaria o problema."
        },
        {
          "pergunta": "Não, seu projeto não está atrasado. Está apenas 'em um cronograma alternativo'.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na negação falsa que usa um eufemismo para ridicularizar o atraso. A ironia seria mais sutil, a hipérbole exageraria o atraso e o eufemismo é usado para criar o efeito sarcástico."
        },
        {
          "pergunta": "Ah, você está me dizendo que 2+2=4? Uau, que revelação incrível! Nunca teria chegado a essa conclusão sozinho.",
          "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
          "correta": 0,
          "explicacao": "O sarcasmo está na falsa surpresa que na verdade ridiculariza uma informação óbvia. A ironia seria menos mordaz, a hipérbole exageraria a obviedade e o eufemismo suavizaria a crítica."
        },
        {
            "pergunta": "Ah, claro! Porque terminar um projeto um mês atrasado é exatamente o que a empresa precisa!",
            "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Eufemismo"],
            "correta": 0,
            "explicacao": "O sarcasmo está na afirmação falsamente positiva que ridiculariza o atraso. A ironia seria mais sutil, a hipérbole exageraria o atraso e o eufemismo suavizaria a crítica."
          },
          {
            "pergunta": "Ótimo! Mais uma reunião de três horas para discutir o óbvio!",
            "opcoes": ["Sarcasmo", "Antítese", "Metáfora", "Personificação"],
            "correta": 0,
            "explicacao": "O sarcasmo está no uso de 'ótimo' para expressar frustração com a reunião. A antítese contrastaria ideias, a metáfora faria uma comparação implícita e a personificação daria vida a objetos."
          },
          {
            "pergunta": "Sim, porque dormir quatro horas por noite é definitivamente saudável!",
            "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Pleonasmo"],
            "correta": 0,
            "explicacao": "O sarcasmo usa tom de falsa concordância para criticar o hábito. A ironia seria menos direta, a hipérbole exageraria os efeitos e o pleonasmo seria redundante."
          },
          {
            "pergunta": "Claro, vamos confiar no Wi-Fi de graça do aeroporto! Ótima ideia!",
            "opcoes": ["Sarcasmo", "Eufemismo", "Metáfora", "Aliteração"],
            "correta": 0,
            "explicacao": "O sarcasmo ridiculariza a confiança em uma conexão insegura. O eufemismo suavizaria, a metáfora compararia conceitos e a aliteração repetiria sons consonantais."
          },
          {
            "pergunta": "Maravilhoso! Meu voo cancelou e agora posso passar o Natal no aeroporto!",
            "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Metonímia"],
            "correta": 0,
            "explicacao": "O sarcasmo usa 'maravilhoso' para expressar indignação. A ironia seria mais sutil, a hipérbole exageraria o problema e a metonímia substituiria termos relacionados."
          },
          {
            "pergunta": "Incrível! Meu chefe quer o relatório pronto para ontem... de novo!",
            "opcoes": ["Sarcasmo", "Paradoxo", "Zeugma", "Anáfora"],
            "correta": 0,
            "explicacao": "O sarcasmo está na falsa admiração para criticar a demanda irreal. O paradoxo uniria contradições, o zeugma omitiria termos e a anáfora repetiria palavras iniciais."
          },
          {
            "pergunta": "Perfeito! O carro quebrou bem no dia da minha entrevista de emprego!",
            "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Catacrese"],
            "correta": 0,
            "explicacao": "O sarcasmo usa 'perfeito' para destacar a frustração. A ironia seria menos agressiva, a hipérbole exageraria o problema e a catacrese usaria metáforas cristalizadas."
          },
          {
            "pergunta": "Adoro quando esquecem de me incluir no e-mail importante!",
            "opcoes": ["Sarcasmo", "Eufemismo", "Metáfora", "Sinestesia"],
            "correta": 0,
            "explicacao": "O sarcasmo expressa falsa satisfação com um erro alheio. O eufemismo suavizaria, a metáfora compararia conceitos e a sinestesia misturaria sensações."
          },
          {
            "pergunta": "Genial! Colocar açúcar no café salgado vai resolver tudo!",
            "opcoes": ["Sarcasmo", "Ironia", "Hipérbole", "Prosopopeia"],
            "correta": 0,
            "explicacao": "O sarcasmo ridiculariza uma solução absurda. A ironia seria mais sutil, a hipérbole exageraria o efeito e a prosopopeia personificaria objetos."
          },
          {
            "pergunta": "Fantástico! Mais uma promoção que ignora completamente meu trabalho!",
            "opcoes": ["Sarcasmo", "Antítese", "Polissíndeto", "Paronomásia"],
            "correta": 0,
            "explicacao": "O sarcasmo usa 'fantástico' para expressar revolta. A antítese oporia ideias, o polissíndeto repetiria conjunções e a paronomásia usaria palavras de sons semelhantes."
          }
      ]
    },
    "polissindeto": {
    "descricao": "O polissíndeto é uma figura de linguagem que consiste na repetição intencional de conjunções em uma frase ou texto, principalmente a conjunção 'e', com o objetivo de dar ênfase, ritmo ou intensidade à expressão. Este recurso estilístico cria um efeito de acumulação e destaque aos elementos enumerados, tornando o texto mais expressivo e cadenciado. O polissíndeto é comum na literatura, poesia, discursos persuasivos e textos bíblicos, onde a repetição das conjunções produz uma sensação de continuidade, abundância ou de algo interminável. Ao contrário do assíndeto (que elimina as conjunções), o polissíndeto torna as frases mais longas e pausadas, dando um tom solene ou dramático à narrativa.",
    "perguntas": [
      {
        "pergunta": "Ela comprou pão e leite e manteiga e ovos e açúcar para fazer o bolo de aniversário.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre todos os itens da lista. O assíndeto eliminaria as conjunções, a anáfora repetiria palavras no início de frases sucessivas e a elipse omitiria termos subentendidos."
      },
      {
        "pergunta": "O vento soprou e as folhas caíram e os pássaros cantaram e o dia começou.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações. O assíndeto eliminaria as conjunções, a anáfora repetiria palavras no início das frases e a hipérbole exageraria um elemento."
      },
      {
        "pergunta": "Ela chorou e gritou e esperou e nada aconteceu.",
        "opcoes": ["Polissíndeto", "Zeugma", "Metáfora", "Ironia"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição de 'e' ligando os verbos. O zeugma omitiria um termo já mencionado, a metáfora faria uma comparação implícita e a ironia expressaria o oposto do sentido literal."
      },
      {
        "pergunta": "O artista pintou e dançou e cantou e encantou a plateia.",
        "opcoes": ["Polissíndeto", "Pleonasmo", "Personificação", "Eufemismo"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para enfatizar as ações. O pleonasmo seria redundante, a personificação daria vida a objetos e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "O rio correu e transbordou e inundou e destruiu a vila.",
        "opcoes": ["Polissíndeto", "Hipérbole", "Metonímia", "Antítese"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição de 'e' entre os eventos. A hipérbole exageraria o impacto, a metonímia substituiria termos relacionados e a antítese oporia ideias."
      },
      {
        "pergunta": "Ele estudou e trabalhou e lutou e conquistou seu objetivo.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Paradoxo", "Aliteração"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para criar ritmo. O assíndeto eliminaria as conjunções, o paradoxo uniria contradições e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "A criança riu e pulou e brincou e cansou.",
        "opcoes": ["Polissíndeto", "Sarcasmo", "Sinestesia", "Catacrese"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para ligar ações consecutivas. O sarcasmo teria tom irônico, a sinestesia misturaria sensações e a catacrese usaria metáforas cristalizadas."
      },
      {
        "pergunta": "A tempestade rugiu e relampejou e choveu e assustou a todos.",
        "opcoes": ["Polissíndeto", "Hipérbato", "Zeugma", "Prosopopeia"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para dar ênfase aos fenômenos. O hipérbato inverteria a ordem, o zeugma omitiria termos e a prosopopeia personificaria a tempestade."
      },
      {
        "pergunta": "Ela leu e escreveu e revisou e publicou o livro.",
        "opcoes": ["Polissíndeto", "Eufemismo", "Metáfora", "Anacoluto"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para destacar etapas. O eufemismo suavizaria, a metáfora compararia conceitos e o anacoluto quebraria a estrutura sintática."
      },
      {
        "pergunta": "O sol nasceu e iluminou e aqueceu e coloriu o céu.",
        "opcoes": ["Polissíndeto", "Ironia", "Polissemia", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para criar cadência. A ironia expressaria o oposto, a polissemia trataria de múltiplos significados e a hipérbole exageraria um efeito."
      },
      {
        "pergunta": "Ele correu e suou e respirou fundo e venceu a corrida.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Paronomásia", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para ligar ações. O assíndeto eliminaria as conjunções, a paronomásia usaria palavras de sons semelhantes e a elipse omitiria termos."
      },
      {
        "pergunta": "O poeta amou e sofreu e escreveu e imortalizou sua dor.",
        "opcoes": ["Polissíndeto", "Metonímia", "Antítese", "Silepse"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para enfatizar a sequência. A metonímia substituiria termos, a antítese oporia ideias e a silepse faria concordância ideológica."
      },
      {
        "pergunta": "As ondas quebraram e espumaram e retiraram-se e voltaram.",
        "opcoes": ["Polissíndeto", "Personificação", "Hipérbole", "Anáfora"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para criar ritmo. A personificação daria vida às ondas, a hipérbole exageraria o movimento e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "O jardim floresceu e perfumou e atraiu borboletas e encantou.",
        "opcoes": ["Polissíndeto", "Metáfora", "Eufemismo", "Zeugma"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para destacar transformações. A metáfora compararia conceitos, o eufemismo suavizaria e o zeugma omitiria termos."
      },
      {
        "pergunta": "O herói lutou e sangrou e resistiu e venceu o inimigo.",
        "opcoes": ["Polissíndeto", "Sarcasmo", "Pleonasmo", "Paradoxo"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para enfatizar a batalha. O sarcasmo teria tom ácido, o pleonasmo seria redundante e o paradoxo uniria contradições."
      },
      {
        "pergunta": "A música tocou e embalou e comoveu e calou a multidão.",
        "opcoes": ["Polissíndeto", "Ironia", "Catacrese", "Aliteração"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para criar efeito acumulativo. A ironia expressaria o oposto, a catacrese usaria metáforas comuns e a aliteração repetiria sons."
      },
      {
        "pergunta": "Ele plantou e regou e colheu e dividiu os frutos.",
        "opcoes": ["Polissíndeto", "Hipérbole", "Metonímia", "Sinestesia"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para ligar etapas. A hipérbole exageraria a quantidade, a metonímia substituiria termos e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "A noite caiu e escureceu e silenciou e trouxe paz.",
        "opcoes": ["Polissíndeto", "Prosopopeia", "Zeugma", "Antítese"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para dar ritmo à descrição. A prosopopeia personificaria a noite, o zeugma omitiria termos e a antítese oporia ideias."
      },
      {
        "pergunta": "O fogo crepitou e iluminou e aqueceu e consumiu a lenha.",
        "opcoes": ["Polissíndeto", "Metáfora", "Eufemismo", "Hipérbato"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para enfatizar ações. A metáfora compararia conceitos, o eufemismo suavizaria e o hipérbato inverteria a ordem."
      },
      {
        "pergunta": "As crianças correram e pularam e riram e cansaram.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Paronomásia", "Anáfora"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para criar dinamismo. O assíndeto eliminaria as conjunções, a paronomásia usaria palavras parecidas e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "O relógio marcou e tocou e despertou e iniciou o dia.",
        "opcoes": ["Polissíndeto", "Personificação", "Hipérbole", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto usa 'e' para ligar funções do relógio. A personificação daria vida ao objeto, a hipérbole exageraria e a elipse omitiria termos."
      },
      {
        "pergunta": "A chuva caiu e molhou e inundou e transformou a paisagem.",
        "opcoes": ["Polissíndeto", "Ironia", "Metonímia", "Pleonasmo"],
        "correta": 0,
        "explicacao": "O polissíndeto repete 'e' para destacar efeitos. A ironia expressaria o oposto, a metonímia substituiria termos e o pleonasmo seria redundante."
      },
      {
        "pergunta": "E vieram os ventos e caiu a chuva e tremeu a terra e todos se abrigaram em suas casas.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Pleonasmo", "Gradação"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' ligando as orações em sequência. O assíndeto eliminaria as conjunções, o pleonasmo seria uma redundância intencional e a gradação apresentaria uma sequência de intensidade crescente."
      },
      {
        "pergunta": "E ele correu e ele saltou e ele nadou e ele venceu todas as provas do triatlo.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição das conjunções 'e' entre as ações, enquanto a anáfora se manifesta na repetição de 'e ele'. O assíndeto eliminaria as conjunções e a elipse omitiria termos subentendidos."
      },
      {
        "pergunta": "Nem a chuva nem o frio nem o vento impediram a realização do evento ao ar livre.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Antítese", "Silepse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'nem' entre os elementos. O assíndeto eliminaria as conjunções, a antítese apresentaria ideias opostas e a silepse seria uma concordância ideológica."
      },
      {
        "pergunta": "O fazendeiro plantou e cultivou e colheu e vendeu sua produção no mesmo ano.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Zeugma", "Hipérbato"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações consecutivas. O assíndeto eliminaria as conjunções, o zeugma omitiria um termo já expresso e o hipérbato inverteria a ordem natural da frase."
      },
      {
        "pergunta": "E procurou nas gavetas e procurou nos armários e procurou embaixo da cama e não encontrou as chaves perdidas.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as orações, enquanto a anáfora se manifesta na repetição de 'e procurou'. O assíndeto eliminaria as conjunções e a elipse omitiria termos subentendidos."
      },
      {
        "pergunta": "Ou vamos para o cinema ou vamos para o teatro ou ficamos em casa assistindo a um filme.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Pleonasmo", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'ou' entre as alternativas. O assíndeto eliminaria as conjunções, o pleonasmo seria uma redundância intencional e a hipérbole exageraria a situação."
      },
      {
        "pergunta": "O candidato prometeu e jurou e garantiu que resolveria os problemas da cidade.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Gradação", "Metáfora"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre os verbos sinônimos. O assíndeto eliminaria as conjunções, a gradação apresentaria uma sequência de intensidade crescente e a metáfora faria uma comparação implícita."
      },
      {
        "pergunta": "Ela dançou e cantou e sorriu e encantou todos os presentes na festa.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Aliteração"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações realizadas. O assíndeto eliminaria as conjunções, a anáfora repetiria palavras no início de frases sucessivas e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Nem o dinheiro nem o poder nem a fama trazem a verdadeira felicidade.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Antítese", "Eufemismo"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'nem' entre os elementos. O assíndeto eliminaria as conjunções, a antítese apresentaria ideias opostas e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "E entrou na sala e cumprimentou a todos e sentou-se e começou a contar sua história.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Zeugma", "Hipérbato"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações consecutivas. O assíndeto eliminaria as conjunções, o zeugma omitiria um termo já expresso e o hipérbato inverteria a ordem natural da frase."
      },
      {
        "pergunta": "E as crianças riram e os pássaros cantaram e o sol brilhou naquela linda manhã de primavera.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Personificação", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as orações. O assíndeto eliminaria as conjunções, a personificação atribuiria características humanas aos pássaros e ao sol, e a elipse omitiria termos subentendidos."
      },
      {
        "pergunta": "Ou você estuda ou você trabalha ou você fica sem fazer nada, mas precisa decidir.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Antítese", "Pleonasmo"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'ou' entre as alternativas. O assíndeto eliminaria as conjunções, a antítese apresentaria ideias opostas e o pleonasmo seria uma redundância intencional."
      },
      {
        "pergunta": "A professora explicou e exemplificou e revisou e aplicou exercícios sobre o tema.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Gradação", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações pedagógicas. O assíndeto eliminaria as conjunções, a gradação apresentaria uma sequência de intensidade crescente e a hipérbole exageraria a situação."
      },
      {
        "pergunta": "E choveu durante dias e os rios transbordaram e as casas foram inundadas e as pessoas perderam tudo.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Catacrese"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as consequências da chuva. O assíndeto eliminaria as conjunções, a anáfora repetiria palavras no início de frases sucessivas e a catacrese seria uma metáfora de uso comum."
      },
      {
        "pergunta": "Nem o cansaço nem a distância nem os obstáculos o impediram de concluir a maratona.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Hipérbole", "Eufemismo"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'nem' entre os elementos. O assíndeto eliminaria as conjunções, a hipérbole exageraria os desafios e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "E olhou para o céu e viu as estrelas e sentiu-se pequeno diante da imensidão do universo.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Zeugma", "Metáfora"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações e percepções. O assíndeto eliminaria as conjunções, o zeugma omitiria um termo já expresso e a metáfora faria uma comparação implícita."
      },
      {
        "pergunta": "E suspirou e chorou e lamentou a perda irreparável.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Hipérbato", "Gradação"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as manifestações de tristeza. O assíndeto eliminaria as conjunções, o hipérbato inverteria a ordem natural da frase e a gradação apresentaria uma sequência de intensidade crescente."
      },
      {
        "pergunta": "Ou aceita as regras ou aceita as consequências ou desiste do jogo agora mesmo.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Antítese", "Elipse"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'ou' entre as alternativas. O assíndeto eliminaria as conjunções, a antítese apresentaria ideias opostas e a elipse omitiria termos subentendidos."
      },
      {
        "pergunta": "O político discursou e prometeu e convenceu e ganhou muitos eleitores naquela noite.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Eufemismo", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações persuasivas. O assíndeto eliminaria as conjunções, o eufemismo suavizaria uma expressão e a hipérbole exageraria o sucesso do discurso."
      },
      {
        "pergunta": "E sonhou com o mar e sonhou com as montanhas e sonhou com uma vida diferente.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Metonímia"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre os sonhos, enquanto a anáfora se manifesta na repetição de 'e sonhou'. O assíndeto eliminaria as conjunções e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "Nem as críticas nem as provocações nem os obstáculos mudaram sua determinação em vencer.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Silepse", "Eufemismo"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'nem' entre os elementos. O assíndeto eliminaria as conjunções, a silepse seria uma concordância ideológica e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "E andou pela praia e sentiu a areia nos pés e ouviu o barulho das ondas e respirou o ar salgado do mar.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Zeugma", "Sinestesia"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as sensações experimentadas. O assíndeto eliminaria as conjunções, o zeugma omitiria um termo já expresso e a sinestesia misturaria percepções sensoriais diferentes."
      },
      {
        "pergunta": "E caminhou e caminhou e caminhou até encontrar o que procurava.",
        "opcoes": ["Polissíndeto", "Assíndeto", "Anáfora", "Hipérbole"],
        "correta": 0,
        "explicacao": "O polissíndeto está na repetição da conjunção 'e' entre as ações repetidas, enquanto a anáfora se manifesta na repetição de 'e caminhou'. O assíndeto eliminaria as conjunções e a hipérbole exageraria a distância percorrida."
      }
    ]
  },
  "assindeto": {
    "descricao": "O assíndeto é uma figura de linguagem que se caracteriza pela omissão de conjunções coordenativas entre palavras, orações ou frases, criando um efeito de rapidez, dinamismo e intensidade. É frequentemente utilizado em textos literários, discursos e até na linguagem cotidiana para tornar a narrativa mais ágil e expressiva. Diferente do polissíndeto, que enfatiza a repetição de conjunções, o assíndeto dá fluidez ao discurso, gerando um ritmo acelerado que pode transmitir urgência, emoção ou dramaticidade.",
    "perguntas": [
      {
        "pergunta": "Ela correu, tropeçou, levantou, seguiu em frente sem olhar para trás.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Elipse", "Zeugma"],
        "correta": 0,
        "explicacao": "O assíndeto está presente na ausência de conjunções entre as ações, conferindo um ritmo acelerado à narrativa. O polissíndeto usaria conjunções repetidas, a elipse omite termos subentendidos e o zeugma omite um termo já expresso anteriormente."
      },
      {
        "pergunta": "Pegou o casaco, saiu, fechou a porta, desapareceu na noite fria.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbato", "Gradação"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na omissão das conjunções entre os verbos, criando uma sequência rápida e fluída. O polissíndeto adicionaria conjunções repetidas, o hipérbato inverteria a ordem dos termos e a gradação indicaria uma progressão de intensidade."
      },
      {
        "pergunta": "A noite caiu, o vento soprou, as luzes se apagaram, tudo ficou em silêncio.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Anáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "O assíndeto está na ausência de conjunções entre as orações, tornando o ritmo mais dinâmico. O polissíndeto usaria conjunções repetitivas, a anáfora repetiria palavras no início das frases e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "O guerreiro avançou, ergueu a espada, golpeou o inimigo, venceu a batalha.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbole", "Metonímia"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções entre os verbos, deixando a narrativa mais ágil. O polissíndeto usaria conjunções repetidas, a hipérbole exageraria a ação e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "Chegou, olhou, sorriu, seguiu seu caminho.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Zeugma", "Paralelismo"],
        "correta": 0,
        "explicacao": "O assíndeto está na ausência de conjunções entre as ações, tornando a sequência rápida. O polissíndeto usaria conjunções repetidas, o zeugma omite um termo já expresso e o paralelismo criaria estruturas repetitivas."
      },
      {
        "pergunta": "Abriu o livro, folheou as páginas, encontrou a passagem que procurava.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbato", "Metáfora"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão de conjunções entre as ações, criando um ritmo acelerado. O polissíndeto usaria conjunções repetitivas, o hipérbato inverteria a ordem das palavras e a metáfora faria uma comparação implícita."
      },
      {
        "pergunta": "Sentou-se, respirou fundo, fechou os olhos, dormiu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Elipse", "Silepse"],
        "correta": 0,
        "explicacao": "O assíndeto está na falta de conjunções entre os verbos, tornando a cena mais dinâmica. O polissíndeto usaria conjunções repetidas, a elipse omitiria um termo subentendido e a silepse indicaria concordância ideológica."
      },
      {
        "pergunta": "Ela chorou, gritou, pediu ajuda, ninguém apareceu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbole", "Anáfora"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções entre os verbos, criando um ritmo acelerado. O polissíndeto adicionaria conjunções repetidas, a hipérbole exageraria a situação e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "O sol brilhou, os pássaros cantaram, a brisa soprou suavemente.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Personificação", "Eufemismo"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções entre as frases, conferindo fluidez ao texto. O polissíndeto usaria conjunções repetidas, a personificação atribuiria características humanas à natureza e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "Pegou a mala, entrou no carro, partiu sem se despedir.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Metáfora", "Zeugma"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na ausência de conjunções entre as ações, tornando a narrativa mais ágil. O polissíndeto usaria conjunções repetidas, a metáfora faria uma comparação implícita e o zeugma omitiria um termo já expresso anteriormente."
      },
      {
        "pergunta": "Chegou, viu, venceu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Elipse", "Pleonasmo"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na ausência de conjunções entre as ações, criando uma progressão rápida. O polissíndeto usaria conjunções repetidas, a elipse omite termos subentendidos e o pleonasmo reforçaria uma ideia com redundância."
      },
      {
        "pergunta": "Levantei, tomei banho, saí para trabalhar.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Zeugma", "Gradação"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções entre as ações diárias, conferindo fluidez ao relato. O polissíndeto adicionaria conjunções repetidas, o zeugma omitiria um termo já expresso e a gradação apresentaria uma sequência de intensidade crescente."
      },
      {
        "pergunta": "Correu, gritou, ninguém ouviu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbole", "Metonímia"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções, tornando a cena mais dramática e intensa. O polissíndeto usaria conjunções repetidas, a hipérbole exageraria a ação e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "Comprou a passagem, embarcou, nunca mais voltou.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Eufemismo", "Silepse"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções entre as ações, tornando a narração mais objetiva. O polissíndeto usaria conjunções repetidas, o eufemismo suavizaria uma ideia e a silepse indicaria concordância ideológica."
      },
      {
        "pergunta": "Gritou, bateu a porta, foi embora.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Anáfora", "Catacrese"],
        "correta": 0,
        "explicacao": "O assíndeto está na falta de conjunções entre os verbos, criando um efeito de urgência. O polissíndeto adicionaria conjunções repetidas, a anáfora repetiria palavras no início das frases e a catacrese usaria uma metáfora cristalizada."
      },
      {
        "pergunta": "Chorou, lamentou, aceitou o destino.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Personificação", "Hipérbato"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções entre os verbos, criando uma sequência rápida de sentimentos. O polissíndeto usaria conjunções repetitivas, a personificação atribuiria características humanas a algo inanimado e o hipérbato inverteria a ordem natural das palavras."
      },
      {
        "pergunta": "Começou a chover, as ruas se encheram, os carros pararam.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Zeugma", "Antítese"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções entre as orações, tornando o ritmo mais acelerado. O polissíndeto usaria conjunções repetidas, o zeugma omitiria um termo já mencionado e a antítese oporia ideias."
      },
      {
        "pergunta": "Pediu um café, sentou, abriu o jornal.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na ausência de conjunções entre as ações, dando fluidez ao relato. O polissíndeto usaria conjunções repetidas, a metáfora faria uma comparação implícita e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "O relógio marcou seis, os trabalhadores saíram, a cidade despertou.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Personificação", "Aliteração"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções entre as frases, criando um efeito dinâmico. O polissíndeto usaria conjunções repetitivas, a personificação daria características humanas à cidade e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Pegou o telefone, discou, esperou, ninguém atendeu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Gradação", "Paralelismo"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na omissão de conjunções entre as ações, tornando a cena mais rápida. O polissíndeto usaria conjunções repetidas, a gradação indicaria uma sequência de intensidade e o paralelismo criaria estruturas semelhantes."
      },
      {
        "pergunta": "O vento soprou, as folhas caíram, o inverno chegou.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbato", "Pleonasmo"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na ausência de conjunções, criando um ritmo dinâmico e fluido. O polissíndeto usaria conjunções repetidas, o hipérbato inverteria a ordem dos termos e o pleonasmo usaria redundância."
      },
      {
        "pergunta": "Acordou, vestiu-se, saiu apressado.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Metáfora", "Elipse"],
        "correta": 0,
        "explicacao": "O assíndeto está presente na omissão das conjunções, dando fluidez ao relato. O polissíndeto usaria conjunções repetidas, a metáfora compararia algo implicitamente e a elipse omitiria um termo já subentendido."
      },
      {
        "pergunta": "Os soldados avançaram, cercaram o inimigo, atacaram sem piedade.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Zeugma", "Gradação"],
        "correta": 0,
        "explicacao": "O assíndeto se caracteriza pela omissão de conjunções, tornando o ritmo mais ágil e intenso. O polissíndeto usaria conjunções repetidas, o zeugma omite um termo já expresso e a gradação indicaria um aumento de intensidade."
      },
      {
        "pergunta": "Respirou fundo, olhou para o relógio, apressou o passo.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Eufemismo", "Personificação"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na ausência de conjunções entre as ações, deixando o relato mais rápido. O polissíndeto usaria conjunções repetidas, o eufemismo suavizaria uma expressão e a personificação daria características humanas a algo inanimado."
      },
      {
        "pergunta": "Fechou os olhos, escutou o silêncio, adormeceu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Metonímia", "Antítese"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções, criando um efeito de sequência rápida e natural. O polissíndeto usaria conjunções repetidas, a metonímia substituiria um termo por outro relacionado e a antítese apresentaria ideias opostas."
      },
      {
        "pergunta": "O avião decolou, atravessou as nuvens, desapareceu no horizonte.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbole", "Elipse"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções, acelerando o ritmo da narrativa. O polissíndeto usaria conjunções repetidas, a hipérbole exageraria um aspecto da frase e a elipse omitiria um termo já subentendido."
      },
      {
        "pergunta": "Tocou a campainha, esperou, ninguém apareceu.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Pleonasmo", "Zeugma"],
        "correta": 0,
        "explicacao": "O assíndeto se manifesta na ausência de conjunções, tornando a narração mais objetiva. O polissíndeto usaria conjunções repetidas, o pleonasmo reforçaria a ideia com redundância e o zeugma omitiria um termo já expresso anteriormente."
      },
      {
        "pergunta": "O artista subiu ao palco, ajustou o microfone, começou a cantar.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Eufemismo", "Anáfora"],
        "correta": 0,
        "explicacao": "O assíndeto está na omissão das conjunções entre as ações, criando um efeito ágil. O polissíndeto usaria conjunções repetidas, o eufemismo suavizaria uma expressão e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Saiu de casa, pegou o ônibus, chegou ao trabalho sem atrasos.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Hipérbato", "Metáfora"],
        "correta": 0,
        "explicacao": "O assíndeto aparece na omissão das conjunções, deixando a frase mais direta e objetiva. O polissíndeto usaria conjunções repetidas, o hipérbato inverteria a ordem natural das palavras e a metáfora faria uma comparação implícita."
      },
      {
        "pergunta": "O trovão ecoou, as janelas tremeram, a tempestade começou.",
        "opcoes": ["Assíndeto", "Polissíndeto", "Silepse", "Aliteração"],
        "correta": 0,
        "explicacao": "O assíndeto está na ausência de conjunções, tornando a cena mais dinâmica. O polissíndeto usaria conjunções repetidas, a silepse indicaria concordância ideológica e a aliteração repetiria sons consonantais."
      }
    ]
  },
  "antanaclase": {
    "descricao": "A antanaclase é uma figura de linguagem que ocorre quando uma mesma palavra ou expressão é repetida em um enunciado, mas com significados diferentes. Esse recurso pode gerar ambiguidade, ironia ou um efeito estilístico interessante, sendo comum na literatura, no humor e na retórica. Muitas vezes, a antanaclase é utilizada para dar ênfase a uma ideia ou para brincar com a polissemia das palavras.",
    "perguntas": [
      {
        "pergunta": "O banco faliu, mas eu ainda tenho um banco para sentar e pensar no prejuízo.",
        "opcoes": ["Antanaclase", "Paronomásia", "Polissemia", "Metonímia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre aqui porque a palavra 'banco' é repetida com dois significados diferentes: instituição financeira e assento. A paronomásia envolve palavras de som semelhante, a polissemia trata de palavras com múltiplos significados, mas sem repetição obrigatória, e a metonímia substitui um termo por outro relacionado."
      },
      {
        "pergunta": "O jogo só é jogo quando jogamos com seriedade.",
        "opcoes": ["Antanaclase", "Paradoxo", "Elipse", "Anáfora"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'jogo' com significados distintos: como substantivo e como verbo. O paradoxo envolve ideias contraditórias, a elipse omite termos subentendidos e a anáfora repete palavras no início de frases sucessivas."
      },
      {
        "pergunta": "Quem tem luz própria nunca fica na luz dos outros.",
        "opcoes": ["Antanaclase", "Metáfora", "Polissemia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A antanaclase está na repetição de 'luz', onde no primeiro caso tem um sentido figurado (brilho próprio, destaque) e no segundo, sentido literal. A metáfora compararia um conceito a outro sem relação direta, a polissemia envolveria múltiplos significados sem repetição, e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "Ele trabalha no banco, mas nunca encostou em um banco de praça.",
        "opcoes": ["Antanaclase", "Metonímia", "Paronomásia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'banco' com dois significados diferentes. A metonímia substituiria um termo por outro relacionado, a paronomásia jogaria com palavras parecidas em som, e a hipérbole exageraria uma ideia."
      },
      {
        "pergunta": "O chefe mandou correr atrás do prejuízo, mas correr nunca foi meu forte.",
        "opcoes": ["Antanaclase", "Ironia", "Catacrese", "Silepse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição do verbo 'correr', que primeiro tem sentido figurado (buscar resolver um problema) e depois literal (ação física). A ironia envolve dizer o contrário do que se quer expressar, a catacrese usa uma metáfora já cristalizada, e a silepse faz concordância com a ideia, não com a gramática."
      },
      {
        "pergunta": "O advogado ganhou a causa, mas a causa da sua vitória foi a estratégia.",
        "opcoes": ["Antanaclase", "Paronomásia", "Metáfora", "Anáfora"],
        "correta": 0,
        "explicacao": "A antanaclase está na repetição de 'causa', onde no primeiro caso significa 'processo judicial' e no segundo, 'razão'. A paronomásia envolve palavras semelhantes em som, a metáfora faz uma comparação implícita e a anáfora repete palavras no início de frases sucessivas."
      },
      {
        "pergunta": "Ela pintou o quadro com dedicação, mas o quadro da vida nem sempre é tão bonito.",
        "opcoes": ["Antanaclase", "Metáfora", "Eufemismo", "Ironia"],
        "correta": 0,
        "explicacao": "A antanaclase está na repetição de 'quadro', que no primeiro caso significa 'obra de arte' e no segundo, 'situação'. A metáfora compararia um elemento a outro sem relação direta, o eufemismo suavizaria uma expressão e a ironia diria algo contrário ao que realmente se pensa."
      },
      {
        "pergunta": "Ele perdeu a cabeça no jogo, mas sua cabeça continua no lugar.",
        "opcoes": ["Antanaclase", "Hipérbole", "Metonímia", "Personificação"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'cabeça' tem dois sentidos diferentes: um figurado (perder a calma) e outro literal (parte do corpo). A hipérbole exageraria um aspecto da frase, a metonímia substituiria um termo por outro relacionado e a personificação daria características humanas a algo inanimado."
      },
      {
        "pergunta": "O tempo voa, mas o voo do tempo deixa marcas.",
        "opcoes": ["Antanaclase", "Metáfora", "Prosopopeia", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'voa', que no primeiro uso tem sentido figurado (passa rápido) e no segundo, sentido literal. A metáfora faria uma comparação implícita, a prosopopeia atribuiria características humanas ao tempo, e o pleonasmo usaria redundância."
      },
      {
        "pergunta": "Ele gosta de tocar piano, mas não suporta que toquem no assunto.",
        "opcoes": ["Antanaclase", "Metáfora", "Zeugma", "Elipse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição do verbo 'tocar', onde no primeiro caso significa 'tocar um instrumento' e no segundo, 'mencionar'. A metáfora compararia conceitos diferentes, o zeugma omite um termo já mencionado e a elipse omite algo que pode ser subentendido."
      },
      {
        "pergunta": "A carta foi jogada na mesa, mas quem joga sem pensar perde o jogo.",
        "opcoes": ["Antanaclase", "Paronomásia", "Ironia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A antanaclase está na repetição da palavra 'jogar', onde no primeiro caso significa 'colocar algo' e no segundo, 'participar de um jogo'. A paronomásia envolveria palavras parecidas em som, a ironia diria o contrário do que realmente se pensa e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "Ele falou com classe, mas a classe inteira discordou do que disse.",
        "opcoes": ["Antanaclase", "Polissemia", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'classe' tem dois sentidos diferentes: um figurado (elegância) e outro literal (grupo de alunos). A polissemia envolveria múltiplos significados sem repetição, a metonímia substituiria um termo por outro relacionado e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "O peixe nada no mar, mas nada pode salvá-lo do pescador.",
        "opcoes": ["Antanaclase", "Zeugma", "Anáfora", "Paronomásia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque a palavra 'nada' tem dois significados diferentes: no primeiro caso, é o verbo 'nadar'; no segundo, indica 'ausência de algo'. O zeugma omite um termo já expresso, a anáfora repete palavras no início das frases, e a paronomásia envolve palavras semelhantes em som."
      },
      {
        "pergunta": "A vida é curta, mas a fila da vida é longa.",
        "opcoes": ["Antanaclase", "Metáfora", "Hipérbole", "Eufemismo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'vida', que no primeiro caso significa existência e no segundo, destino ou espera. A metáfora compararia conceitos diferentes, a hipérbole exageraria um fato e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "Ele sempre tem razão, mas a razão de sua teimosia ninguém entende.",
        "opcoes": ["Antanaclase", "Metonímia", "Ironia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'razão', que no primeiro caso significa 'estar certo' e no segundo, 'motivo'. A metonímia substituiria um termo por outro relacionado, a ironia diria algo contrário ao que realmente se pensa e o paradoxo envolveria ideias contraditórias."
      },
      {
        "pergunta": "O carro é velho, mas o velho dono nunca quis vendê-lo.",
        "opcoes": ["Antanaclase", "Hipérbole", "Elipse", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'velho' tem dois sentidos diferentes: no primeiro caso, refere-se à idade do carro; no segundo, à idade do dono. A hipérbole exageraria um fato, a elipse omite um termo subentendido e o pleonasmo reforçaria uma ideia com redundância."
      },
      {
        "pergunta": "O papel do ator é decorar o papel que recebeu.",
        "opcoes": ["Antanaclase", "Metáfora", "Polissemia", "Prosopopeia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'papel', que no primeiro caso significa 'função' e no segundo, 'documento escrito'. A metáfora compararia conceitos diferentes, a polissemia trataria de múltiplos significados sem repetição, e a prosopopeia atribuiria características humanas a seres inanimados."
      },
      {
        "pergunta": "O relógio quebrou, mas o tempo continua passando.",
        "opcoes": ["Antanaclase", "Metonímia", "Sinestesia", "Zeugma"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'tempo' tem dois significados: no primeiro, relacionado ao relógio (instrumento) e no segundo, ao conceito abstrato de passagem dos dias. A metonímia substituiria um termo por outro relacionado, a sinestesia misturaria percepções sensoriais e o zeugma omite um termo já expresso."
      },
      {
        "pergunta": "O jogo acabou, mas ele ainda quer jogar outra partida.",
        "opcoes": ["Antanaclase", "Paronomásia", "Eufemismo", "Elipse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'jogar' tem dois significados: no primeiro caso, refere-se ao 'ato de brincar' e no segundo, ao desejo de iniciar uma nova partida. A paronomásia envolveria palavras semelhantes em som, o eufemismo suavizaria uma ideia e a elipse omite um termo subentendido."
      },
      {
        "pergunta": "O seguro morreu de velho, mas quem não faz seguro se arrepende.",
        "opcoes": ["Antanaclase", "Metáfora", "Paradoxo", "Silepse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'seguro', que no primeiro caso significa 'prudente' e no segundo, refere-se a um contrato de proteção. A metáfora compararia conceitos diferentes, o paradoxo envolveria ideias contraditórias e a silepse faria concordância com a ideia, não com a gramática."
      },
      {
        "pergunta": "Ele foi a pé, mas voltou de carro pelo péssimo estado da estrada.",
        "opcoes": ["Antanaclase", "Pleonasmo", "Metonímia", "Zeugma"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'pé', que no primeiro caso significa 'a pé, caminhando' e no segundo, faz parte da palavra 'péssimo'. O pleonasmo reforçaria uma ideia com redundância, a metonímia substituiria um termo por outro relacionado e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "O bolo ficou ruim, mas ele bolou um jeito de consertá-lo.",
        "opcoes": ["Antanaclase", "Paronomásia", "Polissemia", "Ironia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'bolo', que no primeiro caso significa 'sobremesa' e no segundo, faz parte do verbo 'bolar', que significa 'pensar em algo'. A paronomásia envolveria palavras semelhantes em som, a polissemia trataria de múltiplos significados sem repetição e a ironia diria algo contrário ao que realmente se pensa."
      },
      {
        "pergunta": "O ponto final foi usado no texto, mas essa história ainda não tem ponto final.",
        "opcoes": ["Antanaclase", "Eufemismo", "Metáfora", "Zeugma"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'ponto final' tem dois sentidos diferentes: no primeiro, como elemento gramatical; no segundo, como desfecho de uma história. O eufemismo suavizaria uma ideia, a metáfora compararia conceitos diferentes e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "A música toca na rádio, mas aquela letra me toca profundamente.",
        "opcoes": ["Antanaclase", "Sinestesia", "Paronomásia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'toca', que no primeiro caso significa 'ser reproduzida' e no segundo, 'emocionar'. A sinestesia misturaria percepções sensoriais, a paronomásia envolveria palavras semelhantes em som e a hipérbole exageraria uma ideia."
      },
      {
        "pergunta": "O livro tem capa dura, mas é uma leitura dura de entender.",
        "opcoes": ["Antanaclase", "Metáfora", "Eufemismo", "Ironia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'dura' tem dois significados: no primeiro, refere-se ao material da capa; no segundo, indica dificuldade de leitura. A metáfora compararia conceitos diferentes, o eufemismo suavizaria uma ideia e a ironia diria algo contrário ao que realmente se pensa."
      },
      {
        "pergunta": "O tempo cura tudo, mas, com o tempo, tudo envelhece.",
        "opcoes": ["Antanaclase", "Metonímia", "Eufemismo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'tempo' tem dois sentidos diferentes: no primeiro, refere-se à passagem dos anos como algo que cura; no segundo, como fator de envelhecimento. A metonímia substitui um termo por outro relacionado, o eufemismo suaviza uma ideia e a hipérbole exagera um fato."
      },
      {
        "pergunta": "O peso da idade é grande, mas o peso da mala é ainda maior.",
        "opcoes": ["Antanaclase", "Pleonasmo", "Paronomásia", "Metáfora"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'peso' tem dois sentidos distintos: no primeiro, significa 'responsabilidade ou dificuldade'; no segundo, refere-se ao peso físico da mala. O pleonasmo reforçaria uma ideia com redundância, a paronomásia envolveria palavras semelhantes em som e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "O livro é um sucesso, mas ninguém consegue livrar-se dele.",
        "opcoes": ["Antanaclase", "Metáfora", "Ironia", "Zeugma"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'livro' e 'livrar-se' compartilham a raiz da palavra, mas com sentidos diferentes: um como substantivo e outro como verbo. A metáfora compararia conceitos diferentes, a ironia diria algo contrário ao que se pensa e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "Ela sentiu dor de cabeça, mas a cabeça do problema era outra.",
        "opcoes": ["Antanaclase", "Metonímia", "Eufemismo", "Sinestesia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição de 'cabeça', que no primeiro caso se refere à parte do corpo e, no segundo, ao cerne de um problema. A metonímia substituiria um termo por outro relacionado, o eufemismo suavizaria uma expressão e a sinestesia misturaria percepções sensoriais diferentes."
      },
      {
        "pergunta": "Ele não sabia que sua vida mudaria, mas a mudança da cidade o ajudou.",
        "opcoes": ["Antanaclase", "Metonímia", "Polissemia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'mudança' tem dois sentidos: no primeiro, refere-se a transformação pessoal; no segundo, à troca de localidade. A metonímia substituiria um termo por outro relacionado, a polissemia trata de múltiplos significados sem repetição e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "O banco quebrou, mas o banco da praça continua firme.",
        "opcoes": ["Antanaclase", "Paronomásia", "Ironia", "Metáfora"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'banco' tem dois significados: instituição financeira e assento. A paronomásia envolve palavras semelhantes em som, a ironia diria algo contrário ao que se pensa e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "A prova foi difícil, mas a prova de que ele estudou estava na nota.",
        "opcoes": ["Antanaclase", "Metonímia", "Eufemismo", "Silepse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'prova', onde no primeiro caso significa 'exame' e no segundo, 'evidência'. A metonímia substituiria um termo por outro relacionado, o eufemismo suavizaria uma ideia e a silepse faria concordância com a ideia, não com a gramática."
      },
      {
        "pergunta": "O olhar dele era frio, mas o frio da noite o fez tremer.",
        "opcoes": ["Antanaclase", "Sinestesia", "Pleonasmo", "Metáfora"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição da palavra 'frio', que no primeiro caso indica insensibilidade emocional e no segundo, temperatura baixa. A sinestesia misturaria percepções sensoriais, o pleonasmo reforçaria uma ideia com redundância e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "O jogador fez um belo passe, mas a passagem para a final ainda estava difícil.",
        "opcoes": ["Antanaclase", "Metáfora", "Ironia", "Zeugma"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre na repetição de 'passe', que no primeiro caso se refere a um movimento no jogo e, no segundo, ao progresso na competição. A metáfora compararia conceitos diferentes, a ironia diria algo contrário ao que se pensa e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "Ele perdeu o juízo, mas o juiz manteve o jogo sob controle.",
        "opcoes": ["Antanaclase", "Metonímia", "Paronomásia", "Silepse"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'juízo' tem dois sentidos: no primeiro, refere-se à sanidade mental; no segundo, à função do juiz no jogo. A metonímia substituiria um termo por outro relacionado, a paronomásia jogaria com palavras parecidas em som e a silepse faria concordância ideológica."
      },
      {
        "pergunta": "O chefe me pediu um relatório, mas relatar tudo o que aconteceu não será fácil.",
        "opcoes": ["Antanaclase", "Pleonasmo", "Metáfora", "Ironia"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'relatório' e 'relatar' compartilham a raiz da palavra, mas com sentidos diferentes: um como substantivo e outro como verbo. O pleonasmo reforçaria uma ideia com redundância, a metáfora compararia conceitos diferentes e a ironia diria algo contrário ao que se pensa."
      },
      {
        "pergunta": "Ele tem um plano de saúde, mas precisa de um plano para se manter saudável.",
        "opcoes": ["Antanaclase", "Polissemia", "Metonímia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A antanaclase ocorre porque 'plano' tem dois sentidos: no primeiro, refere-se ao serviço médico; no segundo, a uma estratégia. A polissemia trataria de múltiplos significados sem repetição, a metonímia substituiria um termo por outro relacionado e o paradoxo envolveria ideias contraditórias."
      }
    ]
  },
"aliteração": {
    "descricao": "A aliteração é uma figura de linguagem que consiste na repetição de sons consonantais no início ou no interior de palavras próximas, criando um efeito rítmico e sonoro no texto. Muito utilizada na poesia, na publicidade e em slogans, a aliteração dá musicalidade e destaque às frases, facilitando a memorização e intensificando a expressividade do discurso.",
    "perguntas": [
    {
        "pergunta": "O rato roeu a roupa do rei de Roma.",
        "opcoes": ["Aliteração", "Paronomásia", "Assonância", "Anáfora"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som consonantal 'r' ao longo da frase, criando um ritmo marcante. A paronomásia envolve palavras de sons parecidos, a assonância repete sons vocálicos e a anáfora repete palavras no início das frases."
    },
    {
        "pergunta": "Fui à feira e vi feras ferozes fazendo festa.",
        "opcoes": ["Aliteração", "Paronomásia", "Polissemia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'f' ao longo da frase. A paronomásia brinca com palavras semelhantes, a polissemia envolve múltiplos significados de uma palavra e o eufemismo suaviza uma ideia."
    },
    {
        "pergunta": "Bela borboleta branca bailava brilhantemente.",
        "opcoes": ["Aliteração", "Pleonasmo", "Anáfora", "Hipérbole"],
        "correta": 0,
        "explicacao": "A aliteração se manifesta na repetição do som 'b', criando um efeito sonoro harmonioso. O pleonasmo seria uma redundância intencional, a anáfora repetiria palavras no início das frases e a hipérbole exageraria uma ideia."
    },
    {
        "pergunta": "Pedro pediu para pintar paredes para Pedro Paulo.",
        "opcoes": ["Aliteração", "Paronomásia", "Anáfora", "Metonímia"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'p', conferindo ritmo à frase. A paronomásia brinca com palavras semelhantes, a anáfora repete palavras no início das frases e a metonímia substitui um termo por outro relacionado."
    },
    {
        "pergunta": "Marta mastiga maçãs maduras na manhã.",
        "opcoes": ["Aliteração", "Metáfora", "Zeugma", "Silepse"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'm', criando um efeito de musicalidade. A metáfora compara conceitos distintos, o zeugma omite um termo já expresso e a silepse faz concordância ideológica."
    },
    {
        "pergunta": "Pato nada no parque perto da ponte.",
        "opcoes": ["Aliteração", "Anáfora", "Personificação", "Assíndeto"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'p', criando um efeito sonoro marcante. A anáfora repetiria palavras no início das frases, a personificação atribuiria características humanas a um ser inanimado e o assíndeto eliminaria conjunções."
    },
    {
        "pergunta": "Gatos grandes gostam de gelatina.",
        "opcoes": ["Aliteração", "Paronomásia", "Pleonasmo", "Antítese"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'g', dando ritmo à frase. A paronomásia brinca com palavras semelhantes, o pleonasmo reforça uma ideia com redundância e a antítese opõe ideias."
    },
    {
        "pergunta": "Risos ressoavam rapidamente, revelando reações raras.",
        "opcoes": ["Aliteração", "Anáfora", "Eufemismo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'r', criando fluidez e musicalidade. A anáfora repete palavras no início das frases, o eufemismo suaviza uma expressão e a hipérbole exagera uma ideia."
    },
    {
        "pergunta": "Bebemos boas bebidas bem batidas.",
        "opcoes": ["Aliteração", "Metáfora", "Paronomásia", "Silepse"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'b', criando um efeito sonoro marcante. A metáfora compararia conceitos diferentes, a paronomásia jogaria com palavras semelhantes e a silepse faria concordância ideológica."
    },
    {
        "pergunta": "Vejo vagalumes vagando vagarosamente.",
        "opcoes": ["Aliteração", "Pleonasmo", "Paradoxo", "Metonímia"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'v', criando um efeito rítmico. O pleonasmo reforçaria uma ideia com redundância, o paradoxo envolveria ideias contraditórias e a metonímia substituiria um termo por outro relacionado."
    },
    {
        "pergunta": "Carla correu contra o carro caindo.",
        "opcoes": ["Aliteração", "Metáfora", "Personificação", "Eufemismo"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'c', dando musicalidade à frase. A metáfora compararia conceitos diferentes, a personificação atribuiria características humanas a algo inanimado e o eufemismo suavizaria uma ideia."
    },
    {
        "pergunta": "Dona Dolores decorava delicadamente desenhos detalhados.",
        "opcoes": ["Aliteração", "Paronomásia", "Zeugma", "Sinestesia"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'd', criando um ritmo sonoro envolvente. A paronomásia brincaria com palavras semelhantes, o zeugma omite um termo já expresso e a sinestesia mistura percepções sensoriais."
    },
    {
        "pergunta": "No ninho do neném, nove ninhos novos nasceram.",
        "opcoes": ["Aliteração", "Pleonasmo", "Polissemia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'n', criando fluidez e ritmo. O pleonasmo reforçaria uma ideia com redundância, a polissemia trataria de múltiplos significados de uma palavra e o paradoxo envolveria ideias contraditórias."
    },
    {
        "pergunta": "Zebras zanzam zelosamente ziguezagueando.",
        "opcoes": ["Aliteração", "Paronomásia", "Assonância", "Hipérbole"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'z', conferindo um efeito sonoro característico. A paronomásia brincaria com palavras semelhantes, a assonância repetiria sons vocálicos e a hipérbole exageraria uma ideia."
    },
    {
        "pergunta": "Quero que queime qualquer coisa que quiser.",
        "opcoes": ["Aliteração", "Paronomásia", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'q', criando um efeito sonoro ritmado. A paronomásia brinca com palavras semelhantes, a metáfora faz comparações implícitas e o eufemismo suaviza uma ideia."
      },
      {
        "pergunta": "Ricardo rapidamente recolheu roupas rasgadas.",
        "opcoes": ["Aliteração", "Assonância", "Paronomásia", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'r', dando musicalidade à frase. A assonância repetiria sons vocálicos, a paronomásia brinca com palavras semelhantes e o pleonasmo reforça uma ideia com redundância."
      },
      {
        "pergunta": "Três tristes tigres trituram trigo.",
        "opcoes": ["Aliteração", "Paronomásia", "Metáfora", "Anáfora"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 't', criando um efeito rítmico. A paronomásia usa palavras de sons parecidos, a metáfora compararia conceitos diferentes e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Filhos felizes fazem festas fantásticas.",
        "opcoes": ["Aliteração", "Pleonasmo", "Metáfora", "Personificação"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'f', conferindo musicalidade à frase. O pleonasmo reforçaria uma ideia com redundância, a metáfora compararia conceitos e a personificação daria características humanas a seres inanimados."
      },
      {
        "pergunta": "Na noite negra, nada navega no nevoeiro.",
        "opcoes": ["Aliteração", "Paronomásia", "Eufemismo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'n', criando um efeito sonoro envolvente. A paronomásia brincaria com palavras semelhantes, o eufemismo suavizaria uma expressão e a hipérbole exageraria uma ideia."
      },
      {
        "pergunta": "Muitos meninos moram muito mal.",
        "opcoes": ["Aliteração", "Metonímia", "Ironia", "Zeugma"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'm', conferindo ritmo à frase. A metonímia substitui um termo por outro relacionado, a ironia diz algo contrário ao que realmente se pensa e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "Pelo porto passam pescadores perdidos.",
        "opcoes": ["Aliteração", "Assonância", "Polissemia", "Anáfora"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'p', dando musicalidade ao enunciado. A assonância repetiria sons vocálicos, a polissemia trataria de múltiplos significados de uma palavra e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Sábado será sempre sinônimo de sorrisos.",
        "opcoes": ["Aliteração", "Pleonasmo", "Eufemismo", "Paradoxo"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 's', conferindo um efeito sonoro marcante. O pleonasmo reforçaria uma ideia com redundância, o eufemismo suavizaria uma expressão e o paradoxo envolveria ideias contraditórias."
      },
      {
        "pergunta": "Gatos gordos gostam de galinhas grandes.",
        "opcoes": ["Aliteração", "Personificação", "Metáfora", "Paronomásia"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'g', criando um efeito rítmico. A personificação atribuiria características humanas a seres inanimados, a metáfora compararia conceitos diferentes e a paronomásia jogaria com palavras parecidas."
      },
      {
        "pergunta": "João joga jacas junto ao jardim.",
        "opcoes": ["Aliteração", "Polissemia", "Hipérbole", "Elipse"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'j', dando musicalidade à frase. A polissemia trataria de múltiplos significados de uma palavra, a hipérbole exageraria um fato e a elipse omite um termo já expresso."
      },
      {
        "pergunta": "Bebidas bem batidas batem bonito no bar.",
        "opcoes": ["Aliteração", "Metonímia", "Ironia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'b', conferindo ritmo à frase. A metonímia substitui um termo por outro relacionado, a ironia diria algo contrário ao que realmente se pensa e o paradoxo envolveria ideias contraditórias."
      },
      {
        "pergunta": "Raposas rápidas roubam restos de refeições.",
        "opcoes": ["Aliteração", "Paronomásia", "Zeugma", "Metáfora"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'r', criando um efeito sonoro envolvente. A paronomásia brincaria com palavras semelhantes, o zeugma omite um termo já mencionado e a metáfora compararia conceitos."
      },
      {
        "pergunta": "Verdes vales vibram vitoriosamente.",
        "opcoes": ["Aliteração", "Personificação", "Pleonasmo", "Anáfora"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'v', criando um ritmo envolvente. A personificação atribuiria características humanas a objetos, o pleonasmo reforçaria uma ideia e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Dóceis donzelas dançavam devagar.",
        "opcoes": ["Aliteração", "Metonímia", "Ironia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A aliteração está na repetição do som 'd', conferindo musicalidade à frase. A metonímia substitui um termo por outro relacionado, a ironia diria algo contrário ao que realmente se pensa e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "Pássaros pequenos pousam perto do parque.",
        "opcoes": ["Aliteração", "Pleonasmo", "Metáfora", "Hipérbole"],
        "correta": 0,
        "explicacao": "A aliteração ocorre na repetição do som 'p', criando um efeito sonoro marcante. O pleonasmo reforçaria uma ideia com redundância, a metáfora compararia conceitos e a hipérbole exageraria um fato."
      }
    ]
  },
  "paronomasia": {
    "descricao": "A paronomásia é uma figura de linguagem que consiste no uso de palavras parônimas, ou seja, palavras que possuem sons semelhantes, mas significados diferentes. Esse recurso é frequentemente utilizado na literatura, na publicidade e em trocadilhos humorísticos, criando efeitos estilísticos interessantes e chamando a atenção do leitor ou ouvinte.",
    "perguntas": [
      {
        "pergunta": "O cavaleiro enfrentou o cavalheiro com honra.",
        "opcoes": ["Paronomásia", "Aliteração", "Metáfora", "Polissemia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'cavaleiro' (guerreiro) e 'cavalheiro' (homem educado) são palavras de sons semelhantes, mas com significados diferentes. A aliteração repetiria sons consonantais, a metáfora compararia conceitos distintos e a polissemia trataria de múltiplos significados para uma mesma palavra."
      },
      {
        "pergunta": "O artista pintava a tela com cautela.",
        "opcoes": ["Paronomásia", "Aliteração", "Pleonasmo", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'tela' (quadro) e 'cautela' (cuidado) têm sons parecidos, mas significados diferentes. A aliteração repetiria sons consonantais, o pleonasmo usaria redundância e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "O vencido se sentia ofendido pelo vencedor.",
        "opcoes": ["Paronomásia", "Polissemia", "Metonímia", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'vencido' e 'vencedor' são palavras parecidas, mas com sentidos opostos. A polissemia trataria de uma palavra com múltiplos significados, a metonímia substituiria um termo por outro relacionado e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Comprei uma sessão de cinema na secessão do shopping.",
        "opcoes": ["Paronomásia", "Aliteração", "Hipérbole", "Metáfora"],
        "correta": 0,
        "explicacao": "A paronomásia está na semelhança entre 'sessão' (período de exibição) e 'secessão' (separação de um grupo). A aliteração repetiria sons consonantais, a hipérbole exageraria um fato e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "O estudante tinha um bom argumento sobre o monumento.",
        "opcoes": ["Paronomásia", "Assonância", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'argumento' e 'monumento' têm sons semelhantes, mas significados distintos. A assonância repetiria sons vocálicos, a metonímia substituiria um termo por outro relacionado e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "Ele mostrou um belo concerto no conserto do piano.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Ironia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'concerto' (apresentação musical) e 'conserto' (reparo) têm sons parecidos, mas significados diferentes. O pleonasmo usaria redundância, a ironia diria algo contrário ao esperado e a hipérbole exageraria uma ideia."
      },
      {
        "pergunta": "O conselho avisou sobre os perigos do conselheiro.",
        "opcoes": ["Paronomásia", "Metáfora", "Zeugma", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'conselho' (recomendação) e 'conselheiro' (aquele que dá conselhos) têm sons semelhantes, mas significados diferentes. A metáfora compararia conceitos distintos, o zeugma omite um termo já mencionado e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "Aquela cela estava cheia de cera.",
        "opcoes": ["Paronomásia", "Personificação", "Metonímia", "Polissemia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'cela' (prisão) e 'cera' (substância) têm sons parecidos, mas significados diferentes. A personificação atribuiria características humanas a seres inanimados, a metonímia substituiria um termo por outro relacionado e a polissemia trataria de múltiplos significados para uma mesma palavra."
      },
      {
        "pergunta": "O traje do ator era uma trágica escolha.",
        "opcoes": ["Paronomásia", "Eufemismo", "Hipérbole", "Zeugma"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'traje' (roupa) e 'trágica' (desastroso) têm sons parecidos, mas significados diferentes. O eufemismo suavizaria uma expressão, a hipérbole exageraria um fato e o zeugma omite um termo já expresso."
      },
      {
        "pergunta": "A feira ficou feia depois da tempestade.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Anáfora", "Ironia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'feira' (mercado) e 'feia' (algo sem beleza) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, a anáfora repetiria palavras no início das frases e a ironia diria algo contrário ao que realmente se pensa."
      },
      {
        "pergunta": "Ele publicou um edital sobre a edição do livro.",
        "opcoes": ["Paronomásia", "Metonímia", "Eufemismo", "Personificação"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'edital' (documento oficial) e 'edição' (publicação de livro) têm sons parecidos, mas significados diferentes. A metonímia substituiria um termo por outro relacionado, o eufemismo suavizaria uma expressão e a personificação atribuiria características humanas a seres inanimados."
      },
      {
        "pergunta": "O vulto voltou à vila vagarosamente.",
        "opcoes": ["Paronomásia", "Aliteração", "Pleonasmo", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'vulto' (sombra) e 'voltou' (regressar) possuem sons semelhantes, mas significados distintos. A aliteração repetiria sons consonantais, o pleonasmo reforçaria uma ideia com redundância e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "A renda da empresa depende da venda de renda.",
        "opcoes": ["Paronomásia", "Ironia", "Pleonasmo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'renda' (lucro) e 'renda' (tecido decorativo) possuem sons semelhantes, mas significados diferentes. A ironia diria algo contrário ao que realmente se pensa, o pleonasmo reforçaria uma ideia com redundância e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "A carta do baralho caiu no cartão da mesa.",
        "opcoes": ["Paronomásia", "Aliteração", "Metonímia", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'carta' (do baralho) e 'cartão' (objeto) possuem sons semelhantes, mas significados diferentes. A aliteração repetiria sons consonantais, a metonímia substituiria um termo por outro relacionado e o pleonasmo reforçaria uma ideia com redundância."
      },
      {
        "pergunta": "O cinto apertava, mas o assento era confortável.",
        "opcoes": ["Paronomásia", "Polissemia", "Ironia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'cinto' (acessório) e 'assento' (local para sentar) possuem sons semelhantes, mas significados diferentes. A polissemia trataria de múltiplos significados para uma mesma palavra, a ironia diria algo contrário ao que se pensa e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "O selo da carta era diferente do selo oficial.",
        "opcoes": ["Paronomásia", "Metonímia", "Personificação", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'selo' (de carta) e 'selo' (oficial) possuem sons semelhantes, mas significados diferentes. A metonímia substituiria um termo por outro relacionado, a personificação atribuiria características humanas a algo inanimado e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "O estudo do solo foi fundamental para a saúde do solo.",
        "opcoes": ["Paronomásia", "Polissemia", "Pleonasmo", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'solo' (terreno) e 'solo' (música) possuem sons semelhantes, mas significados diferentes. A polissemia trataria de uma palavra com múltiplos significados, o pleonasmo reforçaria uma ideia e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "A luz intensa iluminava o lusco-fusco da tarde.",
        "opcoes": ["Paronomásia", "Metáfora", "Assonância", "Aliteração"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'luz' (claridade) e 'lusco-fusco' (meia-luz) possuem sons semelhantes, mas significados diferentes. A metáfora compararia conceitos diferentes, a assonância repetiria sons vocálicos e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "A esperança era uma herança deixada pelo avô.",
        "opcoes": ["Paronomásia", "Metonímia", "Polissemia", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'esperança' (sentimento) e 'herança' (bens deixados) possuem sons semelhantes, mas significados diferentes. A metonímia substituiria um termo por outro relacionado, a polissemia trataria de múltiplos significados para uma mesma palavra e o pleonasmo reforçaria uma ideia com redundância."
      },
      {
        "pergunta": "O tiro certeiro atingiu o títere no palco.",
        "opcoes": ["Paronomásia", "Metáfora", "Ironia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'tiro' (disparo) e 'títere' (boneco manipulado) possuem sons semelhantes, mas significados diferentes. A metáfora compararia conceitos distintos, a ironia diria algo contrário ao esperado e o eufemismo suavizaria uma ideia."
      },
      {
        "pergunta": "O boato sobre o voto do ministro se espalhou rapidamente.",
        "opcoes": ["Paronomásia", "Zeugma", "Metonímia", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'boato' (rumor) e 'voto' (escolha eleitoral) possuem sons semelhantes, mas significados diferentes. O zeugma omite um termo já mencionado, a metonímia substituiria um termo por outro relacionado e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "A madeira do madeireiro era a mais cara da feira.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Metáfora", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'madeira' (material) e 'madeireiro' (quem trabalha com madeira) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia, a metáfora compararia conceitos diferentes e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "O relógio marcou a hora da marcha na praça.",
        "opcoes": ["Paronomásia", "Aliteração", "Polissemia", "Anáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'marca' (do relógio) e 'marcha' (desfile) possuem sons semelhantes, mas significados diferentes. A aliteração repetiria sons consonantais, a polissemia trataria de uma palavra com múltiplos significados e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "O cliente alegou que o aluguel estava caro.",
        "opcoes": ["Paronomásia", "Ironia", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'alegou' (afirmou) e 'aluguel' (pagamento pela locação) possuem sons semelhantes, mas significados diferentes. A ironia diria algo contrário ao que realmente se pensa, a metonímia substituiria um termo por outro relacionado e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "O sentido da sentença não fazia muito sentido.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Aliteração", "Metáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'sentido' (direção ou significado) e 'sentença' (decisão judicial ou frase) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, a aliteração repetiria sons consonantais e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "Ele tem um hábito simples, mas habita uma casa luxuosa.",
        "opcoes": ["Paronomásia", "Polissemia", "Metonímia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'hábito' (costume) e 'habita' (residir) possuem sons semelhantes, mas significados diferentes. A polissemia trataria de múltiplos significados para uma mesma palavra, a metonímia substituiria um termo por outro relacionado e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "O oficial deu uma ordem para organizar o evento.",
        "opcoes": ["Paronomásia", "Metáfora", "Aliteração", "Zeugma"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'ordem' (comando) e 'organizar' (arrumar) possuem sons semelhantes, mas significados diferentes. A metáfora compararia conceitos distintos, a aliteração repetiria sons consonantais e o zeugma omite um termo já mencionado."
      },
      {
        "pergunta": "O capitão comandava a tropa no topo do morro.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Polissemia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'tropa' (grupo militar) e 'topo' (ponto alto) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, a polissemia trataria de múltiplos significados para uma mesma palavra e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "O artista usou um compasso para manter o compasso na música.",
        "opcoes": ["Paronomásia", "Metonímia", "Personificação", "Hipérbole"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'compasso' (instrumento de desenho) e 'compasso' (ritmo musical) possuem sons semelhantes, mas significados diferentes. A metonímia substituiria um termo por outro relacionado, a personificação atribuiria características humanas a algo inanimado e a hipérbole exageraria um fato."
      },
      {
        "pergunta": "O professor lecionava com precisão sobre a preensão das palavras.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Anáfora", "Metáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'precisão' (exatidão) e 'preensão' (ato de segurar) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, a anáfora repetiria palavras no início das frases e a metáfora compararia conceitos distintos."
      },
      {
        "pergunta": "O estudante assistiu ao concerto enquanto consertavam o piano.",
        "opcoes": ["Paronomásia", "Zeugma", "Ironia", "Metonímia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'concerto' (apresentação musical) e 'conserto' (reparo) possuem sons semelhantes, mas significados diferentes. O zeugma omite um termo já mencionado, a ironia diria algo contrário ao esperado e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "A imprensa sempre pressiona os políticos sobre promessas.",
        "opcoes": ["Paronomásia", "Polissemia", "Pleonasmo", "Aliteração"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'imprensa' (meios de comunicação) e 'pressiona' (força para obter resposta) possuem sons semelhantes, mas significados diferentes. A polissemia trataria de uma palavra com múltiplos significados, o pleonasmo reforçaria uma ideia com redundância e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "O deputado declarou que não declara imposto há anos.",
        "opcoes": ["Paronomásia", "Ironia", "Hipérbole", "Metáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'declarou' (afirmou) e 'declara' (relata ao governo) possuem sons semelhantes, mas significados diferentes. A ironia diria algo contrário ao esperado, a hipérbole exageraria um fato e a metáfora compararia conceitos diferentes."
      },
      {
        "pergunta": "A televisão transmite novelas, enquanto a novela da política continua.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Eufemismo", "Metonímia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'novela' (obra de ficção) e 'novela' (situação complicada e longa) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, o eufemismo suavizaria uma expressão e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "O músico afinava a nota enquanto analisava a nota do maestro.",
        "opcoes": ["Paronomásia", "Zeugma", "Metáfora", "Polissemia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'nota' (musical) e 'nota' (avaliação) possuem sons semelhantes, mas significados diferentes. O zeugma omite um termo já mencionado, a metáfora compararia conceitos distintos e a polissemia trataria de uma palavra com múltiplos significados."
      },
      {
        "pergunta": "O réu tinha receio da audiência enquanto esperava a audiência do juiz.",
        "opcoes": ["Paronomásia", "Ironia", "Eufemismo", "Metonímia"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'audiência' (público) e 'audiência' (sessão judicial) possuem sons semelhantes, mas significados diferentes. A ironia diria algo contrário ao esperado, o eufemismo suavizaria uma expressão e a metonímia substituiria um termo por outro relacionado."
      },
      {
        "pergunta": "O investidor aplicou dinheiro na empresa e aplicou esforço no projeto.",
        "opcoes": ["Paronomásia", "Pleonasmo", "Hipérbole", "Metáfora"],
        "correta": 0,
        "explicacao": "A paronomásia ocorre porque 'aplicou' (investiu) e 'aplicou' (se esforçou) possuem sons semelhantes, mas significados diferentes. O pleonasmo reforçaria uma ideia com redundância, a hipérbole exageraria um fato e a metáfora compararia conceitos diferentes."
      }
    ]
  },
  "elipse": {
    "descricao": "A elipse é uma figura de linguagem que consiste na omissão de um termo que pode ser facilmente subentendido no contexto da frase. Esse recurso é utilizado para dar dinamismo ao discurso, evitando repetições desnecessárias e tornando a construção textual mais fluida e estilisticamente sofisticada.",
    "perguntas": [
      {
        "pergunta": "Na sala, apenas silêncio.",
        "opcoes": ["Elipse", "Zeugma", "Assíndeto", "Anacoluto"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque o verbo 'havia' foi omitido, mas é facilmente subentendido pelo contexto. O zeugma omite um termo já expresso anteriormente, o assíndeto elimina conjunções e o anacoluto rompe a estrutura sintática da frase."
      },
      {
        "pergunta": "Se precisar, estarei no escritório.",
        "opcoes": ["Elipse", "Zeugma", "Polissemia", "Hipérbato"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque o sujeito da oração ('você') foi omitido, mas pode ser facilmente inferido. O zeugma omite um termo já mencionado, a polissemia trata de múltiplos significados de uma palavra e o hipérbato inverte a ordem dos termos na frase."
      },
      {
        "pergunta": "Antes, tudo era diferente.",
        "opcoes": ["Elipse", "Anáfora", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a oração principal está implícita, podendo ser 'Antes, a situação era diferente'. A anáfora repete palavras no início das frases, a metonímia substitui um termo por outro relacionado e o eufemismo suaviza uma expressão."
      },
      {
        "pergunta": "Depois da festa, ressaca.",
        "opcoes": ["Elipse", "Zeugma", "Paronomásia", "Metáfora"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'Depois da festa, vem a ressaca', mas o verbo foi omitido. O zeugma omite um termo já mencionado, a paronomásia brinca com palavras semelhantes e a metáfora faz comparações implícitas."
      },
      {
        "pergunta": "Pela manhã, café e notícias.",
        "opcoes": ["Elipse", "Metonímia", "Hipérbato", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'Pela manhã, [eu tomo] café e [leio] notícias'. A metonímia substitui um termo por outro relacionado, o hipérbato inverte a ordem da frase e o pleonasmo reforça uma ideia com redundância."
      },
      {
        "pergunta": "Na gaveta, apenas papéis velhos.",
        "opcoes": ["Elipse", "Zeugma", "Metáfora", "Assíndeto"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque o verbo 'havia' foi omitido, mas é subentendido ('Na gaveta, havia apenas papéis velhos'). O zeugma omite um termo já mencionado, a metáfora faz comparações implícitas e o assíndeto elimina conjunções."
      },
      {
        "pergunta": "Na bolsa, carteira e chaves.",
        "opcoes": ["Elipse", "Zeugma", "Pleonasmo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Na bolsa, [há] carteira e chaves'. O zeugma omite um termo já mencionado, o pleonasmo reforça uma ideia com redundância e a hipérbole exagera um fato."
      },
      {
        "pergunta": "De repente, gritos na rua.",
        "opcoes": ["Elipse", "Metáfora", "Anacoluto", "Paradoxo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria '[Houve] gritos na rua'. A metáfora compararia conceitos diferentes, o anacoluto rompe a estrutura da frase e o paradoxo apresenta ideias aparentemente contraditórias."
      },
      {
        "pergunta": "Na mesa, livros; no chão, cadernos.",
        "opcoes": ["Elipse", "Zeugma", "Assíndeto", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A elipse omite o verbo 'há' ou 'estão', subentendido pelo contexto. O zeugma ligaria termos de forma inadequada, o assíndeto eliminaria conjunções e o pleonasmo seria redundante."
      },
      {
        "pergunta": "De manhã, café; à noite, chá.",
        "opcoes": ["Elipse", "Metáfora", "Hipérbole", "Anacoluto"],
        "correta": 0,
        "explicacao": "A elipse omite o verbo 'tomo' ou 'bebo'. A metáfora compararia conceitos, a hipérbole exageraria e o anacoluto quebraria a estrutura sintática."
      },
      {
        "pergunta": "No campo, paz; na cidade, agitação.",
        "opcoes": ["Elipse", "Antítese", "Polissíndeto", "Eufemismo"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A antítese oporia ideias, o polissíndeto repetiria conjunções e o eufemismo suavizaria."
      },
      {
        "pergunta": "Ele preferia suco; ela, refrigerante.",
        "opcoes": ["Elipse", "Silepse", "Paronomásia", "Ironia"],
        "correta": 0,
        "explicacao": "A elipse omite 'preferia'. A silepse faria concordância ideológica, a paronomásia usaria palavras parecidas e a ironia expressaria o oposto."
      },
      {
        "pergunta": "No verão, calor; no inverno, frio.",
        "opcoes": ["Elipse", "Hipérbato", "Personificação", "Catacrese"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. O hipérbato inverteria a ordem, a personificação daria vida a elementos e a catacrese usaria metáforas cristalizadas."
      },
      {
        "pergunta": "Na infância, brincadeiras; na velhice, lembranças.",
        "opcoes": ["Elipse", "Metáfora", "Sinestesia", "Zeugma"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A metáfora compararia conceitos, a sinestesia misturaria sensações e o zeugma omitiria termos."
      },
      {
        "pergunta": "Ele trouxe o vinho; ela, o queijo.",
        "opcoes": ["Elipse", "Assíndeto", "Prosopopeia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A elipse omite 'trouxe'. O assíndeto eliminaria conjunções, a prosopopeia personificaria objetos e o paradoxo uniria contradições."
      },
      {
        "pergunta": "Na sala, silêncio; na cozinha, barulho.",
        "opcoes": ["Elipse", "Hipérbole", "Metonímia", "Anáfora"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A hipérbole exageraria, a metonímia substituiria termos e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "De dia, trabalho; de noite, estudo.",
        "opcoes": ["Elipse", "Sarcasmo", "Aliteração", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A elipse omite 'faço'. O sarcasmo teria tom irônico, a aliteração repetiria sons e o pleonasmo seria redundante."
      },
      {
        "pergunta": "Ele gosta de futebol; ela, de vôlei.",
        "opcoes": ["Elipse", "Ironia", "Eufemismo", "Gradação"],
        "correta": 0,
        "explicacao": "A elipse omite 'gosta'. A ironia expressaria o oposto, o eufemismo suavizaria e a gradação criaria uma sequência de intensidade."
      },
      {
        "pergunta": "No Norte, chuva; no Sul, seca.",
        "opcoes": ["Elipse", "Metáfora", "Hipérbole", "Antítese"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A metáfora compararia conceitos, a hipérbole exageraria e a antítese oporia ideias."
      },
      {
        "pergunta": "Na juventude, energia; na maturidade, experiência.",
        "opcoes": ["Elipse", "Polissíndeto", "Paronomásia", "Zeugma"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. O polissíndeto repetiria conjunções, a paronomásia usaria palavras semelhantes e o zeugma omitiria termos."
      },
      {
        "pergunta": "Ele comprou pão; ela, leite.",
        "opcoes": ["Elipse", "Anacoluto", "Personificação", "Hipérbato"],
        "correta": 0,
        "explicacao": "A elipse omite 'comprou'. O anacoluto quebraria a estrutura, a personificação daria vida a objetos e o hipérbato inverteria a ordem."
      },
      {
        "pergunta": "Na floresta, vida; na cidade, movimento.",
        "opcoes": ["Elipse", "Sarcasmo", "Catacrese", "Sinestesia"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. O sarcasmo teria tom ácido, a catacrese usaria metáforas comuns e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "De manhã cedo, corrida; à tarde, musculação.",
        "opcoes": ["Elipse", "Eufemismo", "Metáfora", "Assíndeto"],
        "correta": 0,
        "explicacao": "A elipse omite 'pratico'. O eufemismo suavizaria, a metáfora compararia conceitos e o assíndeto eliminaria conjunções."
      },
      {
        "pergunta": "Ele escolheu azul; ela, verde.",
        "opcoes": ["Elipse", "Ironia", "Polissíndeto", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A elipse omite 'escolheu'. A ironia expressaria o oposto, o polissíndeto repetiria conjunções e o pleonasmo seria redundante."
      },
      {
        "pergunta": "No céu, estrelas; na terra, luzes.",
        "opcoes": ["Elipse", "Hipérbole", "Metonímia", "Anáfora"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A hipérbole exageraria, a metonímia substituiria termos e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "Na escola, aprendizado; em casa, descanso.",
        "opcoes": ["Elipse", "Paradoxo", "Zeugma", "Prosopopeia"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. O paradoxo uniria contradições, o zeugma omitiria termos e a prosopopeia personificaria objetos."
      },
      {
        "pergunta": "Ele viajou de carro; ela, de avião.",
        "opcoes": ["Elipse", "Silepse", "Aliteração", "Antítese"],
        "correta": 0,
        "explicacao": "A elipse omite 'viajou'. A silepse faria concordância ideológica, a aliteração repetiria sons e a antítese oporia ideias."
      },
      {
        "pergunta": "Na primavera, flores; no outono, folhas.",
        "opcoes": ["Elipse", "Hipérbole", "Metáfora", "Paronomásia"],
        "correta": 0,
        "explicacao": "A elipse omite 'há'. A hipérbole exageraria, a metáfora compararia conceitos e a paronomásia usaria palavras de sons semelhantes."
      },
      {
        "pergunta": "No final do dia, cansaço absoluto.",
        "opcoes": ["Elipse", "Metonímia", "Zeugma", "Personificação"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'No final do dia, [sinto] cansaço absoluto'. A metonímia substitui um termo por outro relacionado, o zeugma omite um termo já expresso e a personificação atribui características humanas a algo inanimado."
      },
      {
        "pergunta": "Aos poucos, esperança.",
        "opcoes": ["Elipse", "Pleonasmo", "Metáfora", "Aliteração"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a frase completa seria 'Aos poucos, [surgiu a] esperança'. O pleonasmo reforçaria uma ideia, a metáfora compararia conceitos distintos e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Na parede, um quadro antigo.",
        "opcoes": ["Elipse", "Metonímia", "Zeugma", "Assíndeto"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Na parede, [está] um quadro antigo'. A metonímia substituiria um termo por outro relacionado, o zeugma omite um termo já mencionado e o assíndeto elimina conjunções."
      },
      {
        "pergunta": "Sem explicação, foi embora.",
        "opcoes": ["Elipse", "Zeugma", "Paradoxo", "Eufemismo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria '[Ele/ela, sem explicação,] foi embora'. O zeugma omite um termo já mencionado, o paradoxo apresenta ideias aparentemente contraditórias e o eufemismo suaviza uma expressão."
      },
      {
        "pergunta": "Antes tarde do que nunca.",
        "opcoes": ["Elipse", "Pleonasmo", "Paronomásia", "Anáfora"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a frase completa seria 'Antes [chegar] tarde do que nunca'. O pleonasmo reforçaria uma ideia, a paronomásia brincaria com palavras semelhantes e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "No jardim, apenas flores e borboletas.",
        "opcoes": ["Elipse", "Metáfora", "Zeugma", "Personificação"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'No jardim, [havia] apenas flores e borboletas'. A metáfora compararia conceitos distintos, o zeugma omite um termo já mencionado e a personificação atribui características humanas a algo inanimado."
      },
      {
        "pergunta": "Depois do almoço, descanso.",
        "opcoes": ["Elipse", "Pleonasmo", "Aliteração", "Paradoxo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Depois do almoço, [vem o] descanso'. O pleonasmo reforçaria uma ideia, a aliteração repetiria sons consonantais e o paradoxo apresentaria ideias aparentemente contraditórias."
      },
      {
        "pergunta": "Se precisar, estarei no escritório.",
        "opcoes": ["Elipse", "Zeugma", "Polissemia", "Hipérbato"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque o sujeito da oração ('você') foi omitido, mas pode ser facilmente inferido. O zeugma omite um termo já mencionado, a polissemia trata de múltiplos significados de uma palavra e o hipérbato inverte a ordem dos termos na frase."
      },
      {
        "pergunta": "Antes, tudo era diferente.",
        "opcoes": ["Elipse", "Anáfora", "Metonímia", "Eufemismo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a oração principal está implícita, podendo ser 'Antes, a situação era diferente'. A anáfora repete palavras no início das frases, a metonímia substitui um termo por outro relacionado e o eufemismo suaviza uma expressão."
      },
      {
        "pergunta": "Depois da festa, ressaca.",
        "opcoes": ["Elipse", "Zeugma", "Paronomásia", "Metáfora"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'Depois da festa, vem a ressaca', mas o verbo foi omitido. O zeugma omite um termo já mencionado, a paronomásia brinca com palavras semelhantes e a metáfora faz comparações implícitas."
      },
      {
        "pergunta": "Pela manhã, café e notícias.",
        "opcoes": ["Elipse", "Metonímia", "Hipérbato", "Pleonasmo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'Pela manhã, [eu tomo] café e [leio] notícias'. A metonímia substitui um termo por outro relacionado, o hipérbato inverte a ordem da frase e o pleonasmo reforça uma ideia com redundância."
      },
      {
        "pergunta": "Na gaveta, apenas papéis velhos.",
        "opcoes": ["Elipse", "Zeugma", "Metáfora", "Assíndeto"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque o verbo 'havia' foi omitido, mas é subentendido ('Na gaveta, havia apenas papéis velhos'). O zeugma omite um termo já mencionado, a metáfora faz comparações implícitas e o assíndeto elimina conjunções."
      },
      {
        "pergunta": "Na bolsa, carteira e chaves.",
        "opcoes": ["Elipse", "Zeugma", "Pleonasmo", "Hipérbole"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Na bolsa, [há] carteira e chaves'. O zeugma omite um termo já mencionado, o pleonasmo reforça uma ideia com redundância e a hipérbole exagera um fato."
      },
      {
        "pergunta": "De repente, gritos na rua.",
        "opcoes": ["Elipse", "Metáfora", "Anacoluto", "Paradoxo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria '[Houve] gritos na rua'. A metáfora compararia conceitos diferentes, o anacoluto rompe a estrutura da frase e o paradoxo apresenta ideias aparentemente contraditórias."
      },
      {
        "pergunta": "No final do dia, cansaço absoluto.",
        "opcoes": ["Elipse", "Metonímia", "Zeugma", "Personificação"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'No final do dia, [sinto] cansaço absoluto'. A metonímia substitui um termo por outro relacionado, o zeugma omite um termo já expresso e a personificação atribui características humanas a algo inanimado."
      },
      {
        "pergunta": "Aos poucos, esperança.",
        "opcoes": ["Elipse", "Pleonasmo", "Metáfora", "Aliteração"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a frase completa seria 'Aos poucos, [surgiu a] esperança'. O pleonasmo reforçaria uma ideia, a metáfora compararia conceitos distintos e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Na parede, um quadro antigo.",
        "opcoes": ["Elipse", "Metonímia", "Zeugma", "Assíndeto"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Na parede, [está] um quadro antigo'. A metonímia substituiria um termo por outro relacionado, o zeugma omite um termo já mencionado e o assíndeto elimina conjunções."
      },
      {
        "pergunta": "Sem avisar, partiu para sempre.",
        "opcoes": ["Elipse", "Zeugma", "Metáfora", "Eufemismo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria '[Ele/ela] partiu para sempre sem avisar'. O zeugma omite um termo já mencionado, a metáfora compararia conceitos distintos e o eufemismo suavizaria uma expressão."
      },
      {
        "pergunta": "De longe, só silêncio.",
        "opcoes": ["Elipse", "Pleonasmo", "Metonímia", "Paradoxo"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a construção completa seria 'De longe, [ouvia-se] só silêncio'. O pleonasmo reforçaria uma ideia com redundância, a metonímia substituiria um termo por outro relacionado e o paradoxo apresentaria ideias aparentemente contraditórias."
      },
      {
        "pergunta": "Durante a noite, mistério.",
        "opcoes": ["Elipse", "Anáfora", "Zeugma", "Personificação"],
        "correta": 0,
        "explicacao": "A elipse ocorre porque a forma completa seria 'Durante a noite, [havia] mistério'. A anáfora repetiria palavras no início das frases, o zeugma omite um termo já mencionado e a personificação atribui características humanas a algo inanimado."
      }
    ]
  },
  "litote": {
    "descricao": "A litote é uma figura de pensamento que consiste em afirmar algo por meio da negação do seu contrário, muitas vezes com o objetivo de suavizar a mensagem ou criar um efeito de modéstia. É frequentemente utilizada para expressar ideias de forma indireta, usando uma negação para enfatizar uma qualidade ou situação. Por exemplo, dizer 'Ele não é burro' para sugerir que é inteligente. Essa figura é comum em contextos formais, literários e até no discurso cotidiano, sendo útil para evitar afirmações diretas que possam parecer agressivas ou pretensiosas.",
    "perguntas": [
      {
        "pergunta": "Não é que o filme tenha sido um fracasso total...",
        "opcoes": ["Litote", "Eufemismo", "Ironia", "Hipérbole"],
        "correta": 0,
        "explicacao": "A litote está na negação do fracasso total para sugerir que o filme teve algum sucesso. O eufemismo suavizaria uma crítica direta, a ironia expressaria o oposto do sentido literal e a hipérbole exageraria o fracasso."
      },
      {
        "pergunta": "Ela não é a pessoa mais pontual do mundo.",
        "opcoes": ["Litote", "Metáfora", "Sarcasmo", "Antítese"],
        "correta": 0,
        "explicacao": "A litote nega a pontualidade para indicar que ela é desorganizada. A metáfora faria uma comparação implícita, o sarcasmo usaria tom cortante e a antítese apresentaria ideias opostas."
      },
      {
        "pergunta": "Não foi uma viagem completamente desagradável.",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Personificação"],
        "correta": 0,
        "explicacao": "A litote nega o desagradável para sugerir que a viagem teve aspectos positivos. O eufemismo suavizaria uma crítica direta, a hipérbole exageraria o desconforto e a personificação daria características humanas a objetos."
      },
      {
        "pergunta": "Ele não é exatamente um gênio da matemática.",
        "opcoes": ["Litote", "Ironia", "Polissíndeto", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega a genialidade para indicar dificuldade na matéria. A ironia expressaria o oposto do sentido literal, o polissíndeto repetiria conjunções e a metonímia substituiria termos relacionados."
      },
      {
        "pergunta": "Não é que eu discorde totalmente de você...",
        "opcoes": ["Litote", "Sarcasmo", "Assíndeto", "Anáfora"],
        "correta": 0,
        "explicacao": "A litote nega a discordância total para sugerir uma discordância parcial. O sarcasmo usaria tom mordaz, o assíndeto omitiria conjunções e a anáfora repetiria palavras no início das frases."
      },
      {
        "pergunta": "O jantar não estava intragável.",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Paradoxo"],
        "correta": 0,
        "explicacao": "A litote nega o 'intragável' para indicar que o jantar foi aceitável. O eufemismo suavizaria uma crítica, a hipérbole exageraria a qualidade e o paradoxo uniria ideias contraditórias."
      },
      {
        "pergunta": "Não é que ela seja uma má jogadora...",
        "opcoes": ["Litote", "Metáfora", "Ironia", "Zeugma"],
        "correta": 0,
        "explicacao": "A litote nega a má habilidade para sugerir que ela é mediana. A metáfora compararia conceitos, a ironia diria o oposto e o zeugma omitiria um termo já mencionado."
      },
      {
        "pergunta": "Não foi a pior decisão que já tomei.",
        "opcoes": ["Litote", "Hipérbole", "Antítese", "Sinestesia"],
        "correta": 0,
        "explicacao": "A litote nega o 'pior' para indicar que a decisão foi razoável. A hipérbole exageraria a negatividade, a antítese oporia ideias e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "Ele não é o mais comunicativo da equipe.",
        "opcoes": ["Litote", "Eufemismo", "Personificação", "Aliteração"],
        "correta": 0,
        "explicacao": "A litote nega a comunicabilidade para sugerir timidez. O eufemismo suavizaria a crítica, a personificação daria vida a objetos e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Não é que o projeto esteja totalmente atrasado...",
        "opcoes": ["Litote", "Ironia", "Pleonasmo", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega o atraso total para indicar algum progresso. A ironia expressaria o oposto, o pleonasmo seria redundante e a metonímia substituiria termos relacionados."
      },
      {
        "pergunta": "A apresentação não foi um desastre completo.",
        "opcoes": ["Litote", "Hipérbole", "Sarcasmo", "Anacoluto"],
        "correta": 0,
        "explicacao": "A litote nega o desastre para sugerir que houve aspectos positivos. A hipérbole exageraria o fracasso, o sarcasmo usaria tom ácido e o anacoluto quebraria a estrutura sintática."
      },
      {
        "pergunta": "Não é que ele seja um mau cozinheiro...",
        "opcoes": ["Litote", "Eufemismo", "Metáfora", "Polissíndeto"],
        "correta": 0,
        "explicacao": "A litote nega a má habilidade culinária para indicar mediocridade. O eufemismo suavizaria a crítica, a metáfora compararia conceitos e o polissíndeto repetiria conjunções."
      },
      {
        "pergunta": "Não foi uma experiência totalmente inútil.",
        "opcoes": ["Litote", "Ironia", "Hipérbole", "Catacrese"],
        "correta": 0,
        "explicacao": "A litote nega a inutilidade para sugerir algum proveito. A ironia expressaria o oposto, a hipérbole exageraria o desperdício e a catacrese usaria metáforas cristalizadas."
      },
      {
        "pergunta": "Ela não é a pessoa mais paciente que conheço.",
        "opcoes": ["Litote", "Antítese", "Zeugma", "Paronomásia"],
        "correta": 0,
        "explicacao": "A litote nega a paciência para indicar impaciência. A antítese oporia ideias, o zeugma omitiria termos e a paronomásia usaria palavras de sons semelhantes."
      },
      {
        "pergunta": "Não é que o livro seja chato...",
        "opcoes": ["Litote", "Sarcasmo", "Eufemismo", "Hipérbato"],
        "correta": 0,
        "explicacao": "A litote nega o tédio para sugerir que o livro tem partes interessantes. O sarcasmo usaria tom irônico, o eufemismo suavizaria a crítica e o hipérbato inverteria a ordem das palavras."
      },
      {
        "pergunta": "Não foi um investimento completamente perdido.",
        "opcoes": ["Litote", "Metáfora", "Hipérbole", "Assíndeto"],
        "correta": 0,
        "explicacao": "A litote nega a perda total para indicar algum retorno. A metáfora compararia conceitos, a hipérbole exageraria o prejuízo e o assíndeto omitiria conjunções."
      },
      {
        "pergunta": "Ele não é o funcionário mais produtivo do setor.",
        "opcoes": ["Litote", "Ironia", "Personificação", "Anáfora"],
        "correta": 0,
        "explicacao": "A litote nega a produtividade para sugerir que ele é mediano. A ironia expressaria o oposto, a personificação daria vida a objetos e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "Não é que a cidade seja perigosa...",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega o perigo para sugerir que há áreas seguras. O eufemismo suavizaria a crítica, a hipérbole exageraria o risco e a metonímia substituiria termos relacionados."
      },
      {
        "pergunta": "A reunião não foi totalmente improdutiva.",
        "opcoes": ["Litote", "Sarcasmo", "Pleonasmo", "Sinestesia"],
        "correta": 0,
        "explicacao": "A litote nega a improdutividade para indicar algum avanço. O sarcasmo usaria tom ácido, o pleonasmo seria redundante e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "Não é que ele seja desatento...",
        "opcoes": ["Litote", "Metáfora", "Antítese", "Zeugma"],
        "correta": 0,
        "explicacao": "A litote nega a desatenção para sugerir falta de foco ocasional. A metáfora compararia conceitos, a antítese oporia ideias e o zeugma omitiria termos."
      },
      {
        "pergunta": "Não foi uma surpresa completamente desagradável.",
        "opcoes": ["Litote", "Ironia", "Hipérbole", "Elipse"],
        "correta": 0,
        "explicacao": "A litote nega o desagradável para sugerir que a surpresa teve aspectos positivos. A ironia expressaria o oposto, a hipérbole exageraria o impacto e a elipse omitiria termos."
      },
      {
        "pergunta": "Ela não é a mais organizada das colegas.",
        "opcoes": ["Litote", "Eufemismo", "Paradoxo", "Aliteração"],
        "correta": 0,
        "explicacao": "A litote nega a organização para indicar desorganização. O eufemismo suavizaria a crítica, o paradoxo uniria contradições e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Não é que o concerto tenha sido ruim...",
        "opcoes": ["Litote", "Sarcasmo", "Polissíndeto", "Prosopopeia"],
        "correta": 0,
        "explicacao": "A litote nega a qualidade ruim para sugerir que o concerto foi mediano. O sarcasmo usaria tom irônico, o polissíndeto repetiria conjunções e a prosopopeia personificaria objetos."
      },
      {
        "pergunta": "Não foi um dia completamente perdido.",
        "opcoes": ["Litote", "Hipérbole", "Metáfora", "Anacoluto"],
        "correta": 0,
        "explicacao": "A litote nega a perda total para indicar que algo foi aproveitado. A hipérbole exageraria o desperdício, a metáfora compararia conceitos e o anacoluto quebraria a estrutura da frase."
      },
      {
        "pergunta": "Ele não é o mais diplomático dos chefes.",
        "opcoes": ["Litote", "Ironia", "Eufemismo", "Assíndeto"],
        "correta": 0,
        "explicacao": "A litote nega a diplomacia para sugerir falta de tato. A ironia expressaria o oposto, o eufemismo suavizaria a crítica e o assíndeto omitiria conjunções."
      },
      {
        "pergunta": "Não é que o filme seja sem graça...",
        "opcoes": ["Litote", "Hipérbole", "Personificação", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega a falta de graça para sugerir que o filme tem momentos interessantes. A hipérbole exageraria o tédio, a personificação daria vida a objetos e a metonímia substituiria termos."
      },
      {
        "pergunta": "Não foi uma resposta totalmente errada.",
        "opcoes": ["Litote", "Sarcasmo", "Zeugma", "Paronomásia"],
        "correta": 0,
        "explicacao": "A litote nega o erro total para indicar que parte da resposta está correta. O sarcasmo usaria tom irônico, o zeugma omitiria termos e a paronomásia usaria palavras de sons semelhantes."
      },
      {
        "pergunta": "Não é que eu esteja insatisfeito com o serviço...",
        "opcoes": ["Litote", "Eufemismo", "Antítese", "Hipérbato"],
        "correta": 0,
        "explicacao": "A litote nega a insatisfação para sugerir que há espaço para melhorias. O eufemismo suavizaria a crítica, a antítese oporia ideias e o hipérbato inverteria a ordem das palavras."
      },
      {
        "pergunta": "Não foi um esforço completamente em vão.",
        "opcoes": ["Litote", "Hipérbole", "Metáfora", "Anáfora"],
        "correta": 0,
        "explicacao": "A litote nega o esforço inútil para indicar algum resultado. A hipérbole exageraria o desperdício, a metáfora compararia conceitos e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "Ela não é a mais detalhista das profissionais.",
        "opcoes": ["Litote", "Ironia", "Polissíndeto", "Sinestesia"],
        "correta": 0,
        "explicacao": "A litote nega o detalhismo para sugerir falta de atenção. A ironia expressaria o oposto, o polissíndeto repetiria conjunções e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "Não foi uma viagem completamente tranquila.",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Catacrese"],
        "correta": 0,
        "explicacao": "A litote nega a tranquilidade para sugerir que houve contratempos. O eufemismo suavizaria a crítica, a hipérbole exageraria o caos e a catacrese usaria metáforas cristalizadas."
      },
      {
        "pergunta": "Não é que o projeto esteja totalmente fora do prazo...",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Ironia"],
        "correta": 0,
        "explicacao": "A litote nega o atraso total para sugerir que há algum atraso moderado. O eufemismo suavizaria a crítica, a hipérbole exageraria o prazo e a ironia expressaria o oposto do sentido literal."
      },
      {
        "pergunta": "Ele não é exatamente um exemplo de paciência.",
        "opcoes": ["Litote", "Sarcasmo", "Metáfora", "Antítese"],
        "correta": 0,
        "explicacao": "A litote nega a paciência para indicar impaciência. O sarcasmo usaria tom cortante, a metáfora faria uma comparação implícita e a antítese oporia ideias."
      },
      {
        "pergunta": "Não foi uma reação completamente desproporcional.",
        "opcoes": ["Litote", "Hipérbole", "Personificação", "Paradoxo"],
        "correta": 0,
        "explicacao": "A litote nega a desproporção total para sugerir que a reação foi exagerada, mas não absurda. A hipérbole exageraria o evento, a personificação daria vida a objetos e o paradoxo uniria contradições."
      },
      {
        "pergunta": "Não é que o café esteja frio...",
        "opcoes": ["Litote", "Ironia", "Eufemismo", "Aliteração"],
        "correta": 0,
        "explicacao": "A litote nega a temperatura fria para sugerir que o café está morno. A ironia diria o oposto do sentido, o eufemismo suavizaria a crítica e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Ela não é a pessoa mais econômica que conheço.",
        "opcoes": ["Litote", "Metáfora", "Hipérbole", "Zeugma"],
        "correta": 0,
        "explicacao": "A litote nega a economia para indicar gastos excessivos. A metáfora compararia conceitos, a hipérbole exageraria os gastos e o zeugma omitiria um termo já mencionado."
      },
      {
        "pergunta": "Não foi uma solução completamente ineficaz.",
        "opcoes": ["Litote", "Sarcasmo", "Pleonasmo", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega a ineficácia total para sugerir que a solução teve algum efeito. O sarcasmo usaria tom ácido, o pleonasmo seria redundante e a metonímia substituiria termos relacionados."
      },
      {
        "pergunta": "Não é que o livro seja difícil de entender...",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Anáfora"],
        "correta": 0,
        "explicacao": "A litote nega a dificuldade para sugerir complexidade moderada. O eufemismo suavizaria a crítica, a hipérbole exageraria a complexidade e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "Não foi um erro completamente sem consequências.",
        "opcoes": ["Litote", "Ironia", "Personificação", "Paronomásia"],
        "correta": 0,
        "explicacao": "A litote nega a ausência de consequências para indicar impactos leves. A ironia expressaria o oposto, a personificação animaria objetos e a paronomásia usaria palavras de sons semelhantes."
      },
      {
        "pergunta": "Ele não é o mais otimista do grupo.",
        "opcoes": ["Litote", "Metáfora", "Antítese", "Sinestesia"],
        "correta": 0,
        "explicacao": "A litote nega o otimismo para sugerir pessimismo. A metáfora compararia conceitos, a antítese oporia ideias e a sinestesia misturaria sensações."
      },
      {
        "pergunta": "Não é que a viagem tenha sido cansativa...",
        "opcoes": ["Litote", "Hipérbole", "Eufemismo", "Catacrese"],
        "correta": 0,
        "explicacao": "A litote nega o cansaço extremo para sugerir um desgaste moderado. A hipérbole exageraria o cansaço, o eufemismo suavizaria a crítica e a catacrese usaria metáforas cristalizadas."
      },
      {
        "pergunta": "Não foi um desempenho totalmente decepcionante.",
        "opcoes": ["Litote", "Sarcasmo", "Polissíndeto", "Prosopopeia"],
        "correta": 0,
        "explicacao": "A litote nega a decepção total para indicar aspectos positivos. O sarcasmo usaria ironia, o polissíndeto repetiria conjunções e a prosopopeia personificaria objetos."
      },
      {
        "pergunta": "Não é que o concerto tenha sido curto...",
        "opcoes": ["Litote", "Ironia", "Hipérbole", "Elipse"],
        "correta": 0,
        "explicacao": "A litote nega a brevidade para sugerir que o concerto foi longo. A ironia expressaria o oposto, a hipérbole exageraria a duração e a elipse omitiria termos."
      },
      {
        "pergunta": "Não foi uma resposta completamente incorreta.",
        "opcoes": ["Litote", "Eufemismo", "Metáfora", "Assíndeto"],
        "correta": 0,
        "explicacao": "A litote nega o erro total para indicar parcialidade correta. O eufemismo suavizaria a crítica, a metáfora compararia conceitos e o assíndeto omitiria conjunções."
      },
      {
        "pergunta": "Ele não é o mais comunicativo durante as reuniões.",
        "opcoes": ["Litote", "Hipérbole", "Zeugma", "Anacoluto"],
        "correta": 0,
        "explicacao": "A litote nega a comunicação ativa para sugerir timidez. A hipérbole exageraria o silêncio, o zeugma omitiria termos e o anacoluto quebraria a estrutura sintática."
      },
      {
        "pergunta": "Não foi um dia completamente produtivo.",
        "opcoes": ["Litote", "Ironia", "Pleonasmo", "Metonímia"],
        "correta": 0,
        "explicacao": "A litote nega a produtividade total para sugerir alguns resultados. A ironia expressaria o oposto, o pleonasmo seria redundante e a metonímia substituiria termos relacionados."
      },
      {
        "pergunta": "Não é que a comida estivesse sem sabor...",
        "opcoes": ["Litote", "Eufemismo", "Hipérbole", "Paradoxo"],
        "correta": 0,
        "explicacao": "A litote nega a falta de sabor para sugerir tempero moderado. O eufemismo suavizaria a crítica, a hipérbole exageraria o insosso e o paradoxo uniria contradições."
      },
      {
        "pergunta": "Não foi uma experiência completamente traumática.",
        "opcoes": ["Litote", "Sarcasmo", "Personificação", "Aliteração"],
        "correta": 0,
        "explicacao": "A litote nega o trauma total para indicar um impacto suportável. O sarcasmo usaria tom irônico, a personificação animaria objetos e a aliteração repetiria sons consonantais."
      },
      {
        "pergunta": "Não é que ele seja desorganizado...",
        "opcoes": ["Litote", "Metáfora", "Hipérbole", "Anáfora"],
        "correta": 0,
        "explicacao": "A litote nega a desorganização para sugerir falta de método. A metáfora compararia conceitos, a hipérbole exageraria a bagunça e a anáfora repetiria palavras iniciais."
      },
      {
        "pergunta": "Não foi um investimento completamente arriscado.",
        "opcoes": ["Litote", "Ironia", "Eufemismo", "Hipérbato"],
        "correta": 0,
        "explicacao": "A litote nega o risco extremo para sugerir cautela. A ironia expressaria o oposto, o eufemismo suavizaria a crítica e o hipérbato inverteria a ordem das palavras."
      },
      {
        "pergunta": "Não é que a aula tenha sido monótona...",
        "opcoes": ["Litote", "Hipérbole", "Paronomásia", "Zeugma"],
        "correta": 0,
        "explicacao": "A litote nega a monotonia para sugerir variação limitada. A hipérbole exageraria o tédio, a paronomásia usaria palavras de sons semelhantes e o zeugma omitiria termos."
      }
    ]
  }
}       